Repository: eurolinux-enterprise-linux-sources/gnome-user-docs
Catalog: src/gnome2-accessibility-guide/*/*.po
Languages: sv

source: The next item is <guilabel>Key Echo</guilabel>. This option will speak all keys as they are pressed. Type <keycap>y</keycap> or <keycap>n</keycap> and press <keycap>Enter</keycap>.
sv: Nästa funktion är <guilabel>Tangenteko</guilabel>. Detta alternativ kommer att läsa upp alla tangenter när de trycks ned. Ange <keycap>j</keycap> eller <keycap>n</keycap> och tryck på <keycap>Enter</keycap>.

source: Using Orca
sv: Använda Orca

source: Initial Setup
sv: Initial konfiguration

source: How do I run Orca?
sv: Hur kör jag Orca?

source: Quitting Orca
sv: Avsluta Orca

source: Press <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Backspace</keycap></keycombo> to end your login session and get back to the graphical login prompt (not implemented in all Linux distributions).
sv: Press <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Backspace</keycap></keycombo> för att sluta din inloggningssession och gå tillbaka till den grafiska inloggningsprompten (inte implementerad i alla Linux-distributioner).

source: Orca Configuration GUI
sv: Konfigurationsgränssnittet för Orca

source: The <application>Orca</application> Configuration GUI is a dialog containing several tabbed pages, each of which is described in the following sections.
sv: Konfigurationsgränssnittet för <application>Orca</application> är en dialogruta som innehåller flera flikade sidor, var och en av dem beskrivs i följande avsnitt.

source: General Page
sv: Allmänt

source: The <guilabel>General</guilabel> page allows you to customize general aspects of <application>Orca</application>. These include the following:
sv: Sidan <guilabel>Allmänt</guilabel> låter dig anpassa allmänna funktioner i <application>Orca</application>. Dessa inkluderar följande:

source: Keyboard Layout
sv: Tangentbordslayout

source: Show Orca main window
sv: Visa Orcas huvudfönster

source: Quit Orca without Confirmation
sv: Avsluta Orca utan bekräftelse

source: Disable gksu keyboard grab
sv: Inaktivera gksu:s fånst av tangentbordet

source: Present tooltips
sv: Visa verktygstips

source: Speak object under mouse
sv: Läs upp objekt under muspekare

source: Start Orca when you login
sv: Starta Orca när du loggar in

source: Speech Page
sv: Uppläsning

source: Enable speech
sv: Aktivera uppläsning

source: Speech System and Speech Synthesizer
sv: Uppläsningssystem och talsyntes

source: Voice Settings
sv: Röstinställningar

source: Punctuation Level
sv: Skiljeteckensnivå

source: Verbosity
sv: Informationsnivå

source: Table Row Speech
sv: Tabellradsuppläsning

source: You can quickly toggle this behavior by pressing <keycombo><keycap>Orca_Modifier</keycap><keycap>F11</keycap></keycombo>.
sv: Du kan snabbt växla detta beteende genom att trycka på <keycombo><keycap>Orca_Modifier</keycap><keycap>F11</keycap></keycombo>.

source: Speak Progress Bar Updates
sv: Läs upp ändrnigar i förloppsmätare

source: Speak Indentation and Justification
sv: Läs upp indentering och justering

source: Speak Blank Lines
sv: Läs upp blanka rader

source: Speak tutorial messages
sv: Läs upp handledningsmeddelanden

source: Say All By
sv: Läs upp alla efter

source: Braille Page
sv: Punktskrift

source: Enable Braille Support
sv: Aktivera punktskriftsstöd

source: Enable Braille Monitor
sv: Aktivera punktskriftsövervakare

source: Abbreviated Role Names
sv: Förkortade rollnamn

source: Disable end of line symbol
sv: Inaktivera radslutssymbol

source: Contracted Braille
sv: Litterär punktskrift

source: Selection Indicator
sv: Markeringsindikator

source: Hyperlink Indicator
sv: Hyperlänksindikator

source: Key Echo Page
sv: Tangenteko

source: Enable Key Echo
sv: Aktivera tangenteko

source: Modifier keys are those such as <keycap>Shift</keycap>, <keycap>Ctrl</keycap>, and <keycap>Alt</keycap>.
sv: Modifierartangenter är exempelvis <keycap>Skift</keycap>, <keycap>Ctrl</keycap> och <keycap>Alt</keycap>.

source: Enable Echo by Word
sv: Aktivera eko efter ord

source: Enable Echo by Sentence
sv: Aktivera eko efter mening

source: Magnifier Page
sv: Förstorare

source: Enable Magnifier
sv: Aktivera förstorare

source: Zoomer Settings
sv: Zoominställningar

source: Border Settings
sv: Raminställningar

source: Enable border
sv: Aktivera ram

source: Border size
sv: Ramstorlek

source: Cursor Settings
sv: Markörinställningar

source: Enable cursor
sv: Aktivera markör

source: Custom size
sv: Anpassad storlek

source: Cross-hair Settings
sv: Inställningar för sikte

source: Enable cross-hair
sv: Aktivera sikte

source: Cross-hair size
sv: Storlek på sikte

source: Color Settings
sv: Färginställningar

source: Invert colors
sv: Invertera färger

source: Contrast
sv: Kontrast

source: Tracking and Alignment Settings
sv: Inställningar för spårning och justering

source: These options control the tracking of the mouse cursor.
sv: Dessa alternativ kontrollerar spårningen av muspekaren.

source: Mouse pointer
sv: Muspekare

source: Choose from the following options:
sv: Välj från följande alternativ:

source: Centered
sv: Centrerad

source: Control and menu item
sv: Kontroll- och menyobjekt

source: Text cursor
sv: Textmarkör

source: Edge margin
sv: Kantmarginal

source: Advanced Settings
sv: Avancerade inställningar

source: Bilinear or none.
sv: Bilinjär eller ingen.

source: Color Filtering
sv: Färgfiltrering

source: Key Bindings Page
sv: Tangentbindningar

source: Orca Modifier Key(s)
sv: Orcas modifierartangent(er)

source: Key Bindings Table
sv: Tabell över tangentbindningar

source: The "Function" column header is a description of the <application>Orca</application> operation to be performed.
sv: Kolumnhuvudet "Funktion" är en beskrivning av den åtgärd som <application>Orca</application> kommer att genomföra.

source: Beneath the list of <application>Orca</application> keybindings, you will find a group of "unbound" commands:
sv: Under listan över tangentbindningar i <application>Orca</application> så hittar du en grupp av "obundna" kommandon:

source: Pronunciation Page
sv: Uttal

source: Press the <guibutton>New Entry</guibutton> button (<keycombo><keycap>Alt</keycap><keycap>N</keycap></keycombo>).
sv: Tryck på <guibutton>Ny post</guibutton>-knappen (<keycombo><keycap>Alt</keycap><keycap>N</keycap></keycombo>).

source: Move to the entry you wish to delete.
sv: Flytta till posten som du vill ta bort.

source: Press the Delete button or <keycombo><keycap>Alt</keycap><keycap>D</keycap></keycombo>.
sv: Tryck på Delete-tangenten eller <keycombo><keycap>Alt</keycap><keycap>D</keycap></keycombo>.

source: Text Attributes Page
sv: Textattribut

source: The name of the text attribute.
sv: Namnet på textattributet.

source: There is also a <guibutton>Reset</guibutton> button (<keycombo><keycap>Alt</keycap><keycap>R</keycap></keycombo>) which will set the list values back to their initial state when the dialog was first displayed.
sv: Det finns även en <guibutton>Återställ</guibutton>-knapp (<keycombo><keycap>Alt</keycap><keycap>R</keycap></keycombo>) som kommer att ställa in listans värden till deras initiala tillstånd när dialogrutan först visades.

source: <guibutton>Move to top</guibutton> (<keycombo><keycap>Alt</keycap><keycap>T</keycap></keycombo>) - moves the selected attribute to the top of the list.
sv: <guibutton>Flytta överst</guibutton> (<keycombo><keycap>Alt</keycap><keycap>T</keycap></keycombo>) - flyttar det markerade attributet överst i listan.

source: <guibutton>Move up one</guibutton> (<keycombo><keycap>Alt</keycap><keycap>U</keycap></keycombo>) - moves the selected attribute up one row.
sv: <guibutton>Flytta en uppåt</guibutton> (<keycombo><keycap>Alt</keycap><keycap>U</keycap></keycombo>) - flyttar det markerade attributet en rad uppåt.

source: <guibutton>Move down one</guibutton> (<keycombo><keycap>Alt</keycap><keycap>D</keycap></keycombo>) - moves the selected attribute down one row.
sv: <guibutton>Flytta en nedåt</guibutton> (<keycombo><keycap>Alt</keycap><keycap>D</keycap></keycombo>) - flyttar det markerade attributet en rad nedåt.

source: <guibutton>Move to bottom</guibutton> (<keycombo><keycap>Alt</keycap><keycap>B</keycap></keycombo>) - moves the selected attribute to the bottom of the list.
sv: <guibutton>Flytta till nederkant</guibutton> (<keycombo><keycap>Alt</keycap><keycap>B</keycap></keycombo>) - flyttar det markerade attributet till nederkanten av listan.

source: None (the default)
sv: Ingen (standardvärdet)

source: Dot 7
sv: Punkt 7

source: Dot 8
sv: Punkt 8

source: Dots 7 and 8
sv: Punkt 7 och 8

source: Orca Keyboard Commands
sv: Tangentbordskommandon för Orca

source: Desktop Layout
sv: Layout för stationär dator

source: Following is a list of common <application>Orca</application> keyboard commands for desktop keyboards arranged by category:
sv: Följande är en lista över vanliga tangentbordskommandon i <application>Orca</application> för tangentbord på stationära datorer, arrangerade efter kategori:

source: Flat review commands
sv: Kommandon för platt granskning

source: Bookmark commands
sv: Bokmärkeskommandon

source: <keycombo><keycap>Alt</keycap><keycap>Insert</keycap><keycap>[1-6]</keycap></keycombo> - assign a bookmark to a numbered slot. If a bookmark already exists in the slot it will be replaced with the new one.
sv: <keycombo><keycap>Alt</keycap><keycap>Insert</keycap><keycap>[1-6]</keycap></keycombo> - tilldela ett bokmärke en numrerad plats. Om ett bokmärke redan finns i platsen så kommer den att ersättas med den nya.

source: <keycombo><keycap>Insert</keycap><keycap>[1-6]</keycap></keycombo> - go to the position pointed to by the bookmark bound to this numbered slot.
sv: <keycombo><keycap>Insert</keycap><keycap>[1-6]</keycap></keycombo> - gå till positionen som pekas till av bokmärket som är bundet till denna numrerade plats.

source: <keycombo><keycap>Alt</keycap><keycap>Shift</keycap><keycap>[1-6]</keycap></keycombo> - "Where am I" information for this bookmark relative to the current pointer location.
sv: <keycombo><keycap>Alt</keycap><keycap>Shift</keycap><keycap>[1-6]</keycap></keycombo> - "Var är jag"-information för detta bokmärke relativt till den aktuella pekarplatsen.

source: <keycombo><keycap>Insert</keycap><keycap>B</keycap></keycombo> and <keycombo><keycap>Insert</keycap><keycap>Shift</keycap><keycap>B</keycap></keycombo> - move between the given bookmarks for the given application or page.
sv: <keycombo><keycap>Insert</keycap><keycap>B</keycap></keycombo> och <keycombo><keycap>Insert</keycap><keycap>Skift</keycap><keycap>B</keycap></keycombo> - förflytta mellan angivna bokmärken för det angivna programmet eller sidan.

source: <keycombo><keycap>Alt</keycap><keycap>Insert</keycap><keycap>B</keycap></keycombo> - save the defined bookmarks for the current application or page.
sv: <keycombo><keycap>Alt</keycap><keycap>Insert</keycap><keycap>B</keycap></keycombo> - spara definierade bokmärken för det aktuella programmet eller sidan.

source: Miscellaneous functions
sv: Diverse funktioner

source: <keycombo><keycap>Numpad</keycap><keycap>Plus</keycap></keycombo> - "say all" command; reads from the current position of the caret to the end of the document.
sv: <keycombo><keycap>Numeriska tangentbordet</keycap><keycap>Plus</keycap></keycombo> - "läs upp allt"-kommando; läser upp från aktuell position för markören till slutet av dokumentet.

source: <keycombo><keycap>Numpad</keycap><keycap>Enter</keycap></keycombo> - "Where am I" command; speaks information such as the title of the current application window, as well as the name of the control that currently has focus.
sv: <keycombo><keycap>Numeriska tangentbordet</keycap><keycap>Enter</keycap></keycombo> - "Var är jag"-kommando; läser upp information såsom titeln på aktuellt programfönster, såväl som namnet på kontrollen som för närvarande har fokus.

source: <keycombo><keycap>Insert</keycap><keycap>H</keycap></keycombo> - enter into <application>Orca</application>'s "learn mode"; press <keycap>Escape</keycap> to exit.
sv: <keycombo><keycap>Insert</keycap><keycap>H</keycap></keycombo> - gå in i <application>Orca</application>s "inlärningsläge"; tryck på <keycap>Escape</keycap> för att avsluta.

source: <keycombo><keycap>Insert</keycap><keycap>F</keycap></keycombo> - speak font and attribute information for the current character.
sv: <keycombo><keycap>Insert</keycap><keycap>F</keycap></keycombo> - läs upp information om typsnit och attribut för det aktuella tecknet.

source: <keycombo><keycap>Insert</keycap><keycap>Space</keycap></keycombo> - Launch the <application>Orca</application> Configuration dialog.
sv: <keycombo><keycap>Insert</keycap><keycap>Blanksteg</keycap></keycombo> - Starta konfigurationsdialogen för <application>Orca</application>.

source: <keycombo><keycap>Insert</keycap><keycap>Ctrl</keycap><keycap>Space</keycap></keycombo> - reload user settings and reinitialize services as necessary. Also launches the <application>Orca</application> Configuration dialog for the current application.
sv: <keycombo><keycap>Insert</keycap><keycap>Ctrl</keycap><keycap>Blanksteg</keycap></keycombo> - läser om användarinställningar och initierar om tjänster som behövs. Startar även konfigurationsdialogen för <application>Orca</application> för det aktuella programmet.

source: <keycombo><keycap>Insert</keycap><keycap>S</keycap></keycombo> - toggle speech on and off.
sv: <keycombo><keycap>Insert</keycap><keycap>S</keycap></keycombo> - växla uppläsning av eller på.

source: <keycombo><keycap>Insert</keycap><keycap>F11</keycap></keycombo> - toggle the reading of tables, either by single cell or whole row.
sv: <keycombo><keycap>Insert</keycap><keycap>F11</keycap></keycombo> - växla uppläsning av tabeller, antingen efter enstaka cell eller hel rad.

source: <keycombo><keycap>Insert</keycap><keycap>Q</keycap></keycombo> - quit <application>Orca</application>.
sv: <keycombo><keycap>Insert</keycap><keycap>Q</keycap></keycombo> - avsluta <application>Orca</application>.

source: Commands for debugging
sv: Kommandon för felsökning

source: <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap><keycap>Home</keycap></keycombo> - report information on the currently active script.
sv: <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap><keycap>Home</keycap></keycombo> - rapportera information om aktuellt aktivt skript.

source: <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap><keycap>End</keycap></keycombo> - print a debug listing of all known applications to the console where <application>Orca</application> is running.
sv: <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap><keycap>End</keycap></keycombo> - skriv ut felsökningslistning av alla kända program till konsollen där <application>Orca</application> körs.

source: <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap><keycap>Page_Up</keycap></keycombo> - print debug information about the ancestry of the object with focus.
sv: <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap><keycap>Page_Up</keycap></keycombo> - skriv ut felsökningsinformation om ursprunget för objektet med fokus.

source: <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap><keycap>Page_Down</keycap></keycombo> - print debug information about the hierarchy of the application with focus.
sv: <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Insert</keycap><keycap>Page_Down</keycap></keycombo> - skriv ut felsökningsinformation om hierarkin för programmet med fokus.

source: Laptop Layout
sv: Layout för bärbar dator

source: Following is a list of common <application>Orca</application> keyboard commands for laptop keyboards arranged by category:
sv: Följande är en lista över vanliga tangentbordskommandon i <application>Orca</application> för tangentbord på bärbara datorer, arrangerade efter kategori:

source: <keycombo><keycap>Caps_Lock</keycap><keycap>I</keycap></keycombo> - read the current line. Double-click to read the current line along with formatting and capitalization details.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>I</keycap></keycombo> - läs den aktuella raden. Dubbelklicka för att läsa den aktuella raden tillsammans med formatering och skiftlägesdetaljer.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>K</keycap></keycombo> - read the current word. Double-click to spell the word. Triple-click to hear the word spelled phonetically.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>K</keycap></keycombo> - läser det aktuella ordet. Dubbelklicka för att stava ordet. Trippelklicka för att höra ordet fonetiskt uttalat.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>L</keycap></keycombo> - move the flat review cursor to the next word and read it. Double- click to move flat review to the word below the current word.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>L</keycap></keycombo> - flytta markör för platts granskning till nästa ord och läs det. Dubbelklicka för att flytta platt granskning till ordet under det aktuella ordet.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>M</keycap></keycombo> - move the flat review cursor to the previous character and read it. Double-click to move flat review to the end of the current line.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>M</keycap></keycombo> - flytta markören för platt granskning till föregående tecken ord läs det. Dubbelklicka för att flytta platt granskning till slutet av den aktuella raden.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>Comma</keycap></keycombo> - read the current character. Double-click to pronounce the character phonetically if it is a letter.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>Komma</keycap></keycombo> - läs det aktuella tecknet. Dubbelklicka för att uttala tecknet fonetiskt, om det är en bokstav.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>Period</keycap></keycombo> - move the flat review cursor to the next character and read it.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>Punkt</keycap></keycombo> - flytta markören för platt granskning till nästa tecken och läs det.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>7</keycap></keycombo> - perform a left mouse click at the location of the flat review cursor.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>7</keycap></keycombo> - genomför ett vänstermusklick på platsen för markören för platt granskning.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>8</keycap></keycombo> - perform a right mouse click at the location of the flat review cursor.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>8</keycap></keycombo> - genomför ett högermusklick på platsen för markören för platt granskning.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>p</keycap></keycombo> - toggle between flat review and focus tracking mode.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>p</keycap></keycombo> - växla mellan platt granskning och fokusspårningsläge.

source: <keycombo><keycap>Alt</keycap><keycap>Caps_Lock</keycap><keycap>[1-6]</keycap></keycombo> - add a bookmark to the numbered slot. If a bookmark already exists for the slot it will be replaced with the new one.
sv: <keycombo><keycap>Alt</keycap><keycap>Caps_Lock</keycap><keycap>[1-6]</keycap></keycombo> - lägg till ett bokmärke till numrerad plats. Om ett bokmärke redan finns i platsen så kommer det att ersättas med den nya.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>[1-6]</keycap></keycombo> - go to the position pointed to by the bookmark bound to this numbered slot.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>[1-6]</keycap></keycombo> - gå till positionen som pekas till av bokmärket bundet till denna numrerade plats.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>B</keycap></keycombo>and <keycombo><keycap>Caps_Lock</keycap><keycap>Shift</keycap><keycap>B</keycap></keycombo> - move between the given bookmarks for the given application or page.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>B</keycap></keycombo>och <keycombo><keycap>Caps_Lock</keycap><keycap>Skift</keycap><keycap>B</keycap></keycombo> - förflytta mellan angivna bokmärken för det angivna programmet eller sidan.

source: <keycombo><keycap>Alt</keycap><keycap>Caps_Lock</keycap><keycap>B</keycap></keycombo> - save the defined bookmarks for the current application or page.
sv: <keycombo><keycap>Alt</keycap><keycap>Caps_Lock</keycap><keycap>B</keycap></keycombo> - spara definierade bokmärken för det aktuella programmet eller sidan.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>Semicolon</keycap></keycombo> - "Say all" command; reads from the current position of the caret to the end of the document.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>Semikolon</keycap></keycombo> - "Läs upp allt"-kommando; läser upp från aktuell position för markören till slutet på dokumentet.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>Enter</keycap></keycombo> - "Where am I" command; speaks information such as the title of the current application window, as well as the name of the control that currently has focus.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>Enter</keycap></keycombo> - "Var är jag"-kommando; läser upp information såsom titeln på det aktuella programfönstret, såväl som namnet på kontrollen som för närvarande har fokus.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>H</keycap></keycombo> - enter learn mode (press <keycap>Escape</keycap> to exit).
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>H</keycap></keycombo> - gå in i inlärningsläge (tryck på <keycap>Escape</keycap> för att avsluta).

source: <keycombo><keycap>Caps_Lock</keycap><keycap>F</keycap></keycombo> - speak font and attribute information for the current character.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>F</keycap></keycombo> - läs upp information om typsnitt och attribut för aktuellt tecken.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>Space</keycap></keycombo> - launch the <application>Orca</application> Configuration dialog.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>Blanksteg</keycap></keycombo> - starta konfigurationsdialogen för <application>Orca</application>.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>Ctrl</keycap><keycap>Space</keycap></keycombo> - reload user settings and reinitialize services as necessary; also launches the <application>Orca</application> Configuration dialog for the current application.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>Ctrl</keycap><keycap>Blanksteg</keycap></keycombo> - läs om användarinställningar och initiera om tjänster som behövs; startar även konfigurationsdialogen för <application>Orca</application> för det aktuella programmet.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>S</keycap></keycombo> - toggle speech on and off.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>S</keycap></keycombo> - växla uppläsning på och av.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>F11</keycap></keycombo> - toggle the reading of tables, either by single cell or whole row.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>F11</keycap></keycombo> - växla uppläsning av tabeller, antingen efter enstaka cell eller hel rad.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>Q</keycap></keycombo> - quit <application>Orca</application>.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>Q</keycap></keycombo> - avsluta <application>Orca</application>.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>Alt</keycap><keycap>Ctrl</keycap><keycap>Home</keycap></keycombo> - report information on the currently active script.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>Alt</keycap><keycap>Ctrl</keycap><keycap>Home</keycap></keycombo> - rapportera information om för närvarande aktivt skript.
