Repository: eurolinux-enterprise-linux-sources/gnome-user-docs
Catalog: src/gnome2-accessibility-guide/*/*.po
Languages: sv

source: fonts
sv: typsnitt

source: This section describes how to customize the font settings for the desktop and frequently-used applications.
sv: Detta avsnitt beskriver hur man anpassar typsnittsinställningarna för skrivbordet och ofta använda program.

source: If you have difficulty with the default font type and font size that is used on the desktop and desktop background, you can customize the font settings to suit your needs.
sv: Om du har svårigheter med standardtypsnittstypen och typsnitsstorlek som används på skrivbordet och skrivbordsbakgrunden så kan du anpassa typsnittsinställningarna för att passa dina behov.

source: You can specify individual font settings for the following desktop components and applications:
sv: Du kan ange individuella typsnittsinställningar för följande skrivbordskomponenter och program:

source: Entire desktop (excluding the desktop background)
sv: Hela skrivbordet (undantaget skrivbordsbakgrunden)

source: Desktop background only
sv: Endast skrivbordsbakgrund

source: Text Editor
sv: Textredigerare

source: Web Browser
sv: Webbläsare

source: Customizing Desktop Fonts
sv: Anpassa skrivbordstypsnitten

source: desktop fonts
sv: skrivbordstypsnitt

source: The <application>Appearance</application> preference tool allows you to specify the default fonts for the desktop.
sv: Inställningsverktyget <application>Utseende</application> låter dig ange standardtypsnitt för skrivbordet.

source: To start the <application>Appearance</application> preference tool, choose <menuchoice><guimenu>System</guimenu><guisubmenu>Preferences</guisubmenu><guimenuitem>Appearance</guimenuitem></menuchoice>. The <guilabel> Fonts</guilabel> tab contains the following options:
sv: För att starta inställningsverktyget <application>Utseende</application>, välj <menuchoice><guimenu>System</guimenu><guisubmenu>Inställningar</guisubmenu><guimenuitem>Utseende</guimenuitem></menuchoice>. Fliken <guilabel> Typsnitt</guilabel> innehåller följande alternativ:

source: Application Font
sv: Programtypsnitt

source: Click on this button to select a default font to use for the text that is displayed on the desktop, including the text displayed on the windows and dialogs associated with GNOME-compliant applications and panel applications.
sv: Klicka på denna knapp för att välja ett standardtypsnitt att använda för texten som visas på skrivbordet, inklusive texten som visas på fönstren och dialogrutor associerade med GNOME-standardiserade program och panelprogram.

source: If you use a predefined theme and you click on the <guibutton>Apply Font</guibutton> button, the font that is associated with the theme overrides the font from the <application>Appearance</application> preference tool.
sv: Om du använder ett fördefinierat tema och du klickar på knappen <guibutton>Tillämpa typsnitt</guibutton> så kommer typsnittet som är associerat med temat att åsidosätta typsnittet från inställningsverktyget <application>Utseende</application>.

source: Document Font
sv: Dokumenttypsnitt

source: Click on this button to select a font to use for displaying documents.
sv: Klicka på denna knapp för att välja ett typsnitt att använda för visning av dokument.

source: Desktop Font
sv: Skrivbordstypsnitt

source: Click on this button to select a font to use for the text that is displayed on the desktop background only.
sv: Klicka på denna knapp för att välja ett typsnitt att använda för texten som endast visas på skrivbordsbakgrunden.

source: Window Title Font
sv: Fönstertiteltypsnitt

source: Click on this button to select a font to use for the text that is displayed in the titlebar area of windows.
sv: Klicka på denna knapp för att välja ett typsnitt att använda för texten som visas i titellisten på fönster.

source: Fixed Width Font
sv: Typsnitt med fast bredd

source: Click on this button to select a font to use for editing documents.
sv: Klicka på denna knapp för att välja ett typsnitt att använda vid redigering av dokument.

source: Font Rendering
sv: Rendering

source: To specify how to render fonts on the desktop, select one of the following options:
sv: Välj ett av följande alternativ för att ange hur typsnitten ska renderas på skrivbordet:

source: Monochrome
sv: Enfärgad

source: Best Shapes
sv: Bästa former

source: Best Contrast
sv: Bäst kontrast

source: Subpixel Smoothing
sv: Delbildpunktsutjämning

source: If you use large fonts, you may need to change the size of panes in some applications, such as the file manager and Help browser.
sv: Om du använder stora typsnitt så kanske du måste ändra storleken på panelerna i vissa program, såsom filhanteraren och hjälpbläddraren.

source: For more information about the <application>Appearance</application> preference tool and fonts, see the <ulink type="help" url="ghelp:user-guide?prefs-font"> User Guide</ulink>.
sv: För mer information om inställningsverktyget <application>Utseende</application> och typsnitt, se <ulink type="help" url="ghelp:user-guide?prefs-font"> användarguiden</ulink>.

source: Customizing Application Fonts
sv: Anpassa programtypsnitt

source: custom desktop appearance
sv: anpassat skrivbordsutseende

source: set choose individual font
sv: ange individuella typsnitt

source: By default, GNOME applications use the default font specified in the <application>Appearance</application> preference tool. Some applications allow this default font to be customized. These applications are:
sv: Som standard använder GNOME-program standardtypsnittet som angivits i inställningsverktyget <application>Utseende</application>. Vissa program tillåter att detta standardtypsnitt anpassas. Dessa program är:

source: Help Browser
sv: Hjälpbläddrare

source: Meeting Specific Accessibility Needs
sv: Möta specifika hjälpmedelsbehov

source: The following sections summarize the steps you need to take to improve the accessibility of the desktop in a particular area.
sv: Följande avsnitt sammanfattar stegen som du behöver ta för att förbättra hjälpmedelsfunktionerna för skrivbordet i ett specifikt område.

source: Achieving a High- or Low-Contrast Desktop
sv: Få ett skrivbord med hög eller låg kontrast

source: high contrast desktop
sv: skrivbord med hög kontrast

source: low contrast desktop
sv: skrivbord med låg kontrast

source: To achieve a high- or low-contrast desktop, perform the following steps:
sv: Genomför följande steg för att få ett skrivbord med hög eller låg kontrast:

source: Use the <application>Appearance</application> preference tool to select the high-contrast or low-contrast desktop theme that you require from the <guilabel>Theme</guilabel> tab.
sv: Använd inställningsverktyget <application>Utseende</application> för att välja det skrivbordstema med hög eller låg kontrast som du vill använda från fliken <guilabel>Tema</guilabel>.

source: Use the <guilabel>Background</guilabel> tab to customize your desktop background as follows:
sv: Använd fliken <guilabel>Bakgrund</guilabel> för att anpassa din skrivbordsbakgrund enligt följande:

source: Set the <guilabel>Desktop Wallpaper</guilabel> to <guilabel>No Wallpaper</guilabel>.
sv: Ställ in <guilabel>Skrivbordsbakgrund</guilabel> till <guilabel>Ingen skrivbordsbakgrund</guilabel>.

source: Set the <guilabel>Desktop Colors</guilabel> to <guilabel>Solid Color</guilabel>.
sv: Ställ in <guilabel>Skrivbordsfärger</guilabel> till <guilabel>Enfärgad</guilabel>.

source: Select a background color that suits your needs.
sv: Välj en bakgrundsfärg som passar dina behov.

source: In the <application>Terminal</application> application, ensure that the <guilabel>Use colors from system theme</guilabel> option is selected in the <guilabel>Colors</guilabel> tabbed section of the <guilabel>Editing Profile</guilabel> dialog.
sv: I programmet <application>Terminal</application> ska du försäkra dig om att alternativet <guilabel>Använd färger från systemtemat</guilabel> har valts i fliksektionen <guilabel>Färger</guilabel> för dialogrutan <guilabel>Redigerar profilen</guilabel>.

source: In the <application>gedit</application> (Text Editor) application, ensure that the <guilabel>Use default theme colors</guilabel> option is selected in the <guilabel>Fonts &amp; Colors</guilabel> tabbed section of the <guilabel>Preferences</guilabel> dialog.
sv: I programmet <application>gedit</application> (Textredigerare) ska du försäkra dig om att alternativet <guilabel>Använd standardtemafärger</guilabel> har valts i fliksektionen <guilabel>Typsnitt och färger</guilabel> för dialogrutan <guilabel>Inställningar</guilabel>.

source: Achieving a Large Print Desktop
sv: Uppnå ett skrivbord med stor text

source: large print desktop
sv: skrivbord med stor text

source: To achieve a large-print desktop, perform the following steps:
sv: Genomför följande steg för att få ett skrivbord med stor text:

source: Use the <application>Appearance</application> preference tool to select the <guilabel>Large Print</guilabel> theme.
sv: Använd inställningsverktyget <application>Utseende</application> för att välja temat <guilabel>Stor text</guilabel>.

source: Click on the <guibutton>Apply Font</guibutton> button to increase the size of the font that is used on the desktop and on window frames.
sv: Klicka på knappen <guibutton>Tillämpa typsnitt</guibutton> för att öka storleken på typsnittet som används på skrivbordet och på fönsterramar.

source: Use the <guilabel>Desktop Font</guilabel> option in the <guilabel>Font</guilabel> tab to increase the font that is displayed on desktop background objects.
sv: Använd alternativet <guilabel>Skrivbordstypsnitt</guilabel> i fliken <guilabel>Typsnitt</guilabel> för att öka typsnittet som visas på objekten på skrivbordsbakgrunden.

source: Increase the font size that is used to display the contents of the <application>Terminal</application> application window.
sv: Öka typsnittsstorleken som används för att visa innehållet i programfönstret för <application>Terminal</application>.

source: If the <guilabel>Use default theme font</guilabel> option is selected in the <application>gedit</application> (Text Editor) <guilabel>Preferences</guilabel> dialog, <application>gedit</application> uses the font size that is specified in the large-print theme that you selected. However, if the <guilabel>Use default theme font </guilabel> option is not selected, increase the font size that is used to display the contents of the <application>gedit</application> text editor window. See the <ulink type="help" url="ghelp:gedit?gedit-prefs-fontsandcolors">gedit manual</ulink> for more information.
sv: Om alternativet <guilabel>Använd standardtypsnitt för tema</guilabel> har valts i <application>gedit</application> (Textredigerare), dialogrutan <guilabel>Inställningar</guilabel>, så använder <application>gedit</application> typsnittsstorleken som är angivet i temat för stor text som du har valt. Dock, om alternativet <guilabel>Använd standardtypsnitt för tema </guilabel> inte hat valts, öka typsnittsstorleken som används för att visa innehållet i textredigerarfönstret för <application>gedit</application>. Se <ulink type="help" url="ghelp:gedit?gedit-prefs-fontsandcolors">handboken för gedit</ulink> för mer information.

source: If you use applications that use panes, such as the file manager and help browser, you may need to change the size of panes to accommodate the large print. See the online help for the appropriate application for more information.
sv: Om du använder program som använder paneler, såsom filhanteraren och hjälpbläddraren, så kan du behöver ändra storleken på panelerna för att passa den stora texten. Se hjälp på webben för dessa program för mer information.

source: Orca: Screen Reader and Magnifier
sv: Orca: Skärmläsare och -förstorare

source: Screen Reader and Magnifier
sv: Skärmläsare och förstorare

source: The <application>Orca</application> Screen Reader and Magnifier application enables users with limited or no vision to use the GNOME Desktop and associated applications. <application>Orca</application> provides the following functionality:
sv: Programmet <application>Orca</application> skärmläsare och förstorare låter användare med begränsad eller ingen syn att använda GNOME-skrivbordet och dess program. <application>Orca</application> tillhandahåller följande funktionalitet:

source: Screen Reader
sv: Skärmläsare

source: The screen reader enables non-visual access to standard applications in the GNOME Desktop by using speech and braille output.
sv: Skärmläsaren tillåter icke-visuell åtkomst till standardprogram i GNOME-skrivbordet med hjälp av uppläsning och punktskriftsutmatning.

source: Magnifier
sv: Förstorare

source: The magnifier provides automated focus tracking and full-screen magnification to aid low-vision users.
sv: Förstoraren tillhandahåller automatisk fokusspårning och helskärmsförstoring för att hjälpa användare med nedsatt syn.

source: The following sections provide information about <application>Orca</application> and how to use it.
sv: Följande avsnitt tillhandahåller information om <application>Orca</application> och hur man använder det.

source: Introduction to Orca
sv: Introduktion till Orca

source: What is Orca?
sv: Vad är Orca?

source: Orca is a flexible, extensible, and powerful assistive technology for people with visual impairments. Using various combinations of speech synthesis, braille and magnification, Orca helps provide access to applications and toolkits that support the AT-SPI (e.g., the GNOME Desktop). <application>Orca</application> is also free open source software.
sv: Orca är en flexibel, utökningsbar och kraftfull hjälpmedelsteknik för personer med nedsatt syn. Med hjälp av olika kombinationer av talsyntes, punktskrift (braille) och förstoring, hjälper Orca till att tillhandahålla åtkomst till program och verktyg som har stöd för AT-SPI (t.ex., GNOME-skrivbordet). Orca är även en fri programvara med öppen källkod.

source: Why the name Orca?
sv: Varför namnet Orca?

source: One of the first DOS screen readers was Flipper, made by Omnichron Corporation in Berkeley, CA. It was named Flipper in part because the blind wife of the programmer envisioned computers as being programmed by flipping switches (an accurate image of a bygone era). Then came another DOS screen reader, this one from Henter-Joyce in Florida - "Jobs Access With Speech" (or JAWS). And so on....
sv: En av de första skärmläsarna för DOS var Flipper från företaget Omnichron Corporation i Berkeley, Kalifornien. Det kallades för Flipper delvis för att den blinda frun till programmeraren föreställde sig att datorer programmerades genom att slå på strömbrytare (en korrekt bild av en svunnen tid). Sedan kom en annan skärmläsare för DOS från Henter-Joyce i Florida - "Jobs access With Speech" (eller JAWS). Och så vidare ...

source: Although no obvious connection exists between blindness and creatures from the sea, there is certainly a naming tradition for screen-reader software. Hence <application>Orca</application>, which is a lot tougher-sounding than Nemo, Ariel, Willy, or Mr. Limpet.
sv: Även om det inte finns någon självklar koppling mellan blindhet och djur från havet så har det blivit en namntradition för skärmläsarprogram. Därav <application>Orca</application>, som är ett mycket tyngre namn än Nemo, Ariel, Willy eller Mr. Limpet.

source: What's the schedule?
sv: Hur ser schemat ut?

source: <application>Orca</application> is part of the GNOME platform and <application>Orca</application>'s releases are coupled with the releases of the GNOME platform.
sv: <application>Orca</application> är en del av GNOME-plattformen och <application>Orca</application> ges ut i samband med utgåvorna för GNOME-plattformen.

source: How do I request a new feature?
sv: Hur begär jag en ny funktion?

source: <ulink url="http://bugzilla.gnome.org/buglist.cgi?query=product:orca+">Bugs</ulink> and feature/enhancement requests (RFEs) should be reported to the <ulink url="http://bugzilla.gnome.org">GNOME Bug Tracking System </ulink>. Patches are always welcome, and instructions for creating patches can be found in the <ulink url="http://developer.gnome.org/tools/svn.html"> GNOME Introduction to Subversion (SVN) </ulink>.
sv: <ulink url="http://bugzilla.gnome.org/buglist.cgi?query=product:orca+">Fel</ulink> och begäran om funktioner/förbättringar (så kallad RFE) ska rapporteras till <ulink url="http://bugzilla.gnome.org">GNOME:s felhanteringssystem </ulink>. Programfixar välkomnas alltid och instruktioner för att skapa programfixar kan hittas i <ulink url="http://developer.gnome.org/tools/svn.html"> GNOME:s introduktion till Subversion (SVN) </ulink>.

source: Where is the discussion list?
sv: Var finns diskussionslistan?

source: You can get in touch with developers and other users by <ulink url="mailto:orca-list@gnome.org">sending an e-mail</ulink> to the <ulink url="http://mail.gnome.org/mailman/listinfo/orca-list">Orca mailing list</ulink> (<ulink url="http://mail.gnome.org/archives/orca-list">Archives</ulink>).
sv: Du kan komma i kontakt med utvecklarna och andra användare genom att <ulink url="mailto:orca-list@gnome.org">skicka e-post</ulink> till <ulink url="http://mail.gnome.org/mailman/listinfo/orca-list"> Orcas sändlista</ulink> (<ulink url="http://mail.gnome.org/archives/orca-list">sändlistans arkiv</ulink>).

source: Is braille supported?
sv: Stöds punktskrift?

source: Yes! Braille is supported via BrlTTY and it is tightly integrated with Orca. BrlTTY offers support for nearly every refreshable braille display known to man.
sv: Ja! Punktskrift stöds via BrlTTY och det är väl integrerat med Orca. BrlTTY ger stöd för nästan alla uppdateringsbara punktskriftsskärmar som finns idag.

source: Is contracted braille supported?
sv: Stöds litterär punktskrift?

source: Yes, <application>Orca</application> fully supports contracted braille output.
sv: Ja, <application>Orca</application> har fullständigt stöd för utmatning av litterär punktskrift.

source: What voices are available?
sv: Vilka röster finns tillgängliga?

source: <application>Orca</application> provides interfaces to both <userinput>gnome-speech</userinput> and <userinput>emacspeak</userinput> speech services. As such, the available voices for <application>Orca</application> are only restricted by the speech engines supported by the available speech services. For free speech engines, you typically have a choice of the eSpeak, Festival, and FreeTTS speech engines. For commercial engines, you have a choice of additional engines such as Fonix DECtalk, Loquendo, Eloquence, Cepstral and IBMTTS, with others on the way. Periodically check the <userinput>gnome-speech</userinput> package for more progress in this area.
sv: <application>Orca</application> tillhandahåller gränssnitt till uppläsningstjänsterna <userinput>gnome-speech</userinput> och <userinput>emacspeak</userinput>. De tillgängliga rösterna för <application>Orca</application> är endast begränsade av uppläsningsmotorerna som stöds av de tillgängliga uppläsningstjänsterna. För de fria uppläsningsmotorerna står oftast valet mellan eSpeak, Festival och FreeTTS. För kommersiella motorer har du valet mellan ytterligare motorer såsom Fonix DECtalk, Loquendo, Eloquence, Cepstral och IBMTTS, med flera kommande motorer. Ta en titt med jämna mellanrum på paketet <userinput>gnome-speech</userinput> för mer information om kommande funktionalitet på detta område.

source: What languages are supported?
sv: Vilka språk stöds?

source: The <ulink url="http://l10n.gnome.org/teams"> GNOME translation teams</ulink> are composed of many passionate volunteers from around the world. These teams do a great job and keep an up-to-date status report. See the <ulink url="http://l10n.gnome.org/module/orca"> Orca translation status page</ulink> for the large number of languages into which <application>Orca</application> has been translated.
sv: <ulink url="http://l10n.gnome.org/teams"> GNOME:s översättningsgrupper</ulink> är sammansatta av passionerade frivilliga från hela världen. Dessa grupper gör ett stort arbete och följer uppdaterade statusrapporter. Se <ulink url="http://l10n.gnome.org/module/orca"> statussidan för Orca-översättningar</ulink> för ett stort antal språk till vilka <application>Orca</application> har översatts.

source: Note: support for a language also depends on the speech synthesis engine also supporting the same language.
sv: Observera: stöd för ett språk är även beroende av att den valda uppläsningsmotorn finns på samma språk.

source: How well does magnification work?
sv: Hur bra fungerar förstoringsfunktionen?

source: <application>Orca</application> currently uses the <userinput>gnome-mag</userinput> magnification service. <userinput>gnome-mag</userinput> has incorporated support for smoother full-screen magnification, which relies upon newer extensions in the X Window System server. These extensions do not always function well on all platforms, so smooth full-screen magnification may not always work.
sv: <application>Orca</application> använder för närvarande förstoringstjänsten <userinput>gnome-mag</userinput>. <userinput>gnome-mag</userinput> har inbyggt stöd för jämnare helskärmsförstoring, vilken förlitar sig på nyare utökningar i X Window System-servern. Dessa utökningar fungerar inte alltid bra på alla plattformar så därför fungerar kanske inte funktionen för jämn helskärmsförstoring alltid.

source: Enabling Orca
sv: Aktivera Orca

source: For a text-only guided setup, open a Run dialog with <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo> or <keycombo><keycap>Meta</keycap><keycap>R</keycap></keycombo> and use the command <userinput>orca --text-setup</userinput><keycap>Enter</keycap>.
sv: Öppna en Kör-dialog med <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo> eller <keycombo><keycap>Meta</keycap><keycap>R</keycap></keycombo> och använd kommandot <userinput>orca --text-setup</userinput><keycap>Enter</keycap> för en guidad och textbaserad konfiguration.

source: The first time <application>Orca</application> is launched you will be asked a few questions:
sv: Första gången som <application>Orca</application> startas så kommer du att få ett antal frågor:

source: First you will be presented with a list of languages to choose from; there are currently about 45 languages supported. Most of this list will scroll off the screen, so you may have to use the terminal's scrollbar to view earlier parts of the list. Type in the number of your language choice (e.g., 7 for American English) and press <keycap>Enter</keycap>. You do not need to wait for the entire list to be spoken, and Orca attempts to make your default language the first choice (choice 1).
sv: Först kommer du att presenteras med en lista över språk att välja från; det finns för närvarande ungefär 45 språk som stöds. Den största delen av denna lista får inte plats på skärmen så du kanske måste använda terminalen rullningslist för att visa tidigare delar av listan. Ange talet för ditt språkval (t.ex. 1 för Svenska) och tryck på <keycap>Enter</keycap>. Du behöver inte vänta på att hela listan ska läsas upp och Orca försöker att göra ditt standardspråk till det första valet (val nummer 1).

source: You are next asked to set <guilabel>Echo By Word</guilabel>. This option instructs <application>Orca</application> to speak words as you finish typing them. Type <keycap>y</keycap> or <keycap>n</keycap> and press <keycap>Enter</keycap>.
sv: Du kommer härnäst att bli tillfrågad om att ställa in <guilabel>Eko efter ord</guilabel>. Detta alternativ instruerar <application>Orca</application> att läsa upp ord när du har skrivit in dem. Ange <keycap>j</keycap> eller <keycap>n</keycap> och tryck på <keycap>Enter</keycap>.
