Repository: eurolinux-enterprise-linux-sources/gnome-user-docs
Catalog: src/gnome2-accessibility-guide/*/*.po
Languages: sv

source: Run <application>gdmsetup</application> from a terminal; you may be advised to reboot after exiting the application.
sv: Kör <application>gdmsetup</application> från en terminal; du kan bli uppmanad att starta om datorn efter att programmet avslutats.

source: To configure GDM if you cannot access the GUI environment, you will need to navigate the file system and modify files:
sv: För att konfigurera GDM om du inte kan komma åt den grafiska användarmiljön så behöver du navigera i filsystemet och ändra filer:

source: Open the file <filename>/etc/X11/gdm/custom.conf</filename>
sv: Öppna filen <filename>/etc/X11/gdm/custom.conf</filename>

source: Search the file for the following line:
sv: Sök i filen efter följande rad:

source: and replace the line with the following:
sv: och ersätt raden med följande:

source: This step enables the GtkModules.
sv: Dessa steg aktiverar GtkModules.

source: and delete the <literal>#</literal> from the start of the line so that the line reads:
sv: och ta bort <literal>#</literal> från början av raden så att raden ser ut så här:

source: The above lines must be displayed as single lines in the <filename>custom.conf</filename> file without line breaks. The formatting of this guide may display the lines as being longer than two lines.
sv: Ovanstående rader måste visas som ensamma rader i filen <filename>custom.conf</filename> utan radbrytningar. Formateringen av denna guiden kan visa raderna som längre än två rader.

source: This step loads all of the GtkModules to enable assistive technologies such as <application>On-Screen Keyboard</application> and <application>Screen Reader and Magnifier </application>. You can edit the line above further to load only the GtkModules that you require to support the user base. For example:
sv: Detta steg läser in alla GtkModules för att aktivera hjälpmedelstekniker såsom <application>Skärmtangentbord</application> och <application>Skärmläsare och -förstorare</application>. Du kan fortsätta att redigera raden ovan för att endast läsa in den GtkModules som du behöver för att ge stöd till användarna. Till exempel:

source: If you need to use the <application> Screen Reader and Magnifier</application>, include <literal>gail</literal> and <literal>atk-bridge</literal>.
sv: Om du behöver använda <application> Skärmläsare och -förstorare</application>, inkludera <literal>gail</literal> och <literal>atk-bridge</literal>.

source: If you need to use a pointing device without buttons or switches, include <literal>gail</literal>, <literal>atk-bridge</literal> and <literal>dwellmouselistener</literal>.
sv: Om du behöver använda ett pekdon utan knappar eller brytare, inkludera <literal>gail</literal>, <literal>atk-bridge</literal> och <literal>dwellmouselistener</literal>.

source: If you use pointing devices with switches, alternative physical keyboards, or switch and button devices, include <literal>keymouselistener</literal>.
sv: Om du använder pekdon med brytare, alternativa fysiska tangentbord eller enheter med brytare och knappar, inkludera <literal>keymouselistener</literal>.

source: <application>On-Screen Keyboard</application> can operate without <literal>gail</literal> and <literal>atk-bridge</literal>, but with a reduced feature set.
sv: <application>Skärmtangentbord</application> kan fungera utan <literal>gail</literal> och <literal>atk-bridge</literal> men med en reducerad uppsättning funktioner.

source: For optimum accessibility, include <literal>gail</literal> and <literal>atk-bridge</literal>.
sv: För optimala hjälpmedelsfunktioner, inkludera <literal>gail</literal> och <literal>atk-bridge</literal>.

source: Save the <filename>/etc/X11/gdm/custom.conf</filename> file.
sv: Spara filen <filename>/etc/X11/gdm/custom.conf</filename>.

source: If you make any changes to the <filename>/etc/X11/gdm/custom.conf</filename> file after you enable GDM, you can execute the following command to restart GDM and activate the changes:
sv: Om du gör några ändringar i filen <filename>/etc/X11/gdm/custom.conf</filename> efter att du aktiverat GDM, kan du köra följande kommando för att starta om GDM och aktivera ändringarna:

source: Edit the file <filename>/etc/group</filename> and append the following to the <literal>audio</literal> line:
sv: Redigera filen <filename>/etc/group</filename> och lägg till följande på raden med <literal>audio</literal>:

source: This step ensures that speech works with GDM.
sv: Det här steget försäkrar att uppläsning fungerar med GDM.

source: Restart your system.
sv: Starta om ditt system.

source: <application>Xserver</application> is required for all distributions; for Linux and OpenSolaris, it should be <application>Xorg</application>. You can find them in both <filename>/etc/X11</filename> and <filename>/usr/bin</filename>. Generally for Linux there will be a symbol link in <filename>/etc/X11/X</filename> and it is always linked to the binary <filename>Xorg</filename> in <filename>/usr/bin/Xorg</filename>. For OpenSolaris, you can find this process with the command <userinput>ps -ef | grep X</userinput>.
sv: <application>Xserver</application> krävs för alla distributioner; för Linux och OpenSolaris, ska det vara <application>Xorg</application>. Du kan hitta dem i både <filename>/etc/X11</filename> och <filename>/usr/bin</filename>. Oftast finns det för Linux en symbolisk länk i <filename>/etc/X11/X</filename> och den är alltid länkad till binärfilen <filename>Xorg</filename> i <filename>/usr/bin/Xorg</filename>. För OpenSolaris så kan du hitta denna process med kommandot <userinput>ps -ef | grep X</userinput>.

source: To enable or disable <application>Xorg</application> extensions, you can edit the file <filename>/etc/X11/xorg.conf</filename> and add the following parameters to enable different extensions:
sv: För att aktivera eller inaktivera utökningar för <application>Xorg</application> så kan du redigera filen <filename>/etc/X11/xorg.conf</filename> och lägga till följande parametrar för att aktivera olika utökningar:

source: Starting Assistive Technologies at Login
sv: Starta hjälpmedelstekniker vid inloggning

source: gestures
sv: gester

source: If you load the <literal>keymouselistener</literal> and <literal>dwellmouselistener</literal> GtkModules in the GDM configuration file, you can assign user actions to launch specific assistive technologies at login time. These user actions are called gestures. The gesture associations are contained in the following GDM configuration files:
sv: Om du läser in GtkModules <literal>keymouselistener</literal> och <literal>dwellmouselistener</literal> i GDM:s konfigurationsfil, kan du tilldela användaråtgärder för att starta specifika hjälpmedelstekniker vid tid för inloggning. Dessa användaråtgärder kallas för gester. Gesterna som associeras finns i följande konfigurationsfiler för GDM:

source: If you modify these files, you must restart your system before the changes take effect.
sv: Om du ändrar dessa filer måste du starta om ditt system innan ändringarna blir aktiverade.

source: The following sections contain examples of the gestures that you can add to the GDM configuration files.
sv: Följande avsnitt innehåller exempel för gesterna som du kan lägga till i GDM:s konfigurationsfiler.

source: The gestures must be contained in a single line in the <filename>AccessKeyMouseEvents </filename> file without line breaks. The formatting of this guide might display the examples in the following sections across multiple lines.
sv: Gesterna måste finnas på en ensam rad i filen <filename>AccessKeyMouseEvents</filename> utan radbrytningar. Formateringen av denna guiden kan dock visa exemplen i följande avsnitt över flera rader.

source: Starting the Screen Reader Using a Keyboard Shortcut
sv: Starta skärmläsaren med en tangentbordsgenväg

source: Edit the <filename>AccessKeyMouseEvents</filename> file to associate keyboard shortcuts with assistive technologies. For example, the following lines enable you to press and hold <keycombo><keycap>Ctrl</keycap><keycap>S</keycap></keycombo> or <keycombo><keycap>Ctrl</keycap><keycap>M</keycap></keycombo> for one second to either start speech or magnification:
sv: Redigera filen <filename>AccessKeyMouseEvents</filename> för att associera tangentbordsgenvägar med hjälpmedelsteknik. Till exempel låter följande rad dig att trycka och hålla ned <keycombo><keycap>Ctrl</keycap><keycap>S</keycap></keycombo> eller <keycombo><keycap>Ctrl</keycap><keycap>M</keycap></keycombo> i en sekund för att starta antingen uppläsning eller förstoring:

source: Starting On-Screen Keyboard Using a Switch or Button Gesture
sv: Starta skärmtangentbord med en brytare eller knappgest

source: Edit the <filename>AccessKeyMouseEvents</filename> file to associate switch, key, or button gestures with assistive technologies. Since the primary input device for many <application>On-Screen Keyboard</application> users is a switch or button, this is a good way to enable users to start <application>On-Screen Keyboard</application> at login time.
sv: Redigera filen <filename>AccessKeyMouseEvents</filename> för att associera en brytare, tangent eller knappgest med hjälpmedelsteknik. Eftersom den primära inmatningsenheten för många användare med <application>Skärmtangentbord</application> är en brytare eller knapp, så är det ett bra sätt att låta användare starta <application>Skärmtangentbord</application> vid tid för inloggning.

source: If there is a tendency for a user to start an application unintentionally, you can associate the gestures with multiple switch presses or minimum durations. For example, the following line starts <application>On-Screen Keyboard</application> in inverse scanning mode when the user presses the switch that is defined as Switch 2 three times within two seconds, for a minimum of 100 milliseconds for each press:
sv: Om det finns en tendens för en användare att oavsiktligen starta ett problem så kan du associera gesterna med flera brytartryck eller korta tidsperioder. Till exempel så startar följande rad <application>Skärmtangentbord</application> i omvänt avsökningsläge när användaren trycker på brytaren som är definierad som Brytare 2 tre gånger inom två sekunder, för ett minimum på 100 millisekunder för varje tryckning:

source: Users who use single switches may prefer to start <application>On-Screen Keyboard</application> in automatic scanning mode. The following line starts <application>On-Screen Keyboard</application> in automatic scanning mode when the user presses the switch on an alternative access device for more than four seconds:
sv: Användare som använder enkla brytare kan föredra att starta <application>Skärmtangentbord</application> i automatiskt avsökningsläge. Följande rad startar <application>Skärmtangentbord</application> i automatiskt avsökningsläge när användaren trycker på brytaren på en alternativ åtkomstenhet i mer än fyra sekunder:

source: For information about the <application>On-Screen Keyboard</application> operating modes, see the online help for <application>On-Screen Keyboard</application>.
sv: För information om åtgärdslägen för <application>Skärmtangentbord</application>, se hjälpsidan för <application>Skärmtangentbord</application> på webben.

source: Starting On-Screen Keyboard Using a Motion-Only Gesture
sv: Starta skärmtangentbord med endast en rörelsegest

source: You can define gestures that involve only the motion of a pointing device such as a mouse, or an alternative pointing device, such as a head pointer or trackball. The syntax of the gesture does not change depending on whether you are using a mouse or an alternative pointing device. Edit the <filename>AccessKeyMouseEvents</filename> file to associate motion gestures with assistive technologies.
sv: Du kan definiera gester som innefattar rörelsen av en pekenhet, såsom en mus, eller en alternativ pekenhet, såsom en huvudpekare eller styrkula. Syntaxen för gesten ändrar sig inte beroende på huruvida du använder en mus eller en alternativ pekenhet. Redigera filen <filename>AccessKeyMouseEvents</filename> för att associera rörelsegester med hjälpmedelsfunktioner.

source: If the <literal>dwellmouselistener</literal> GtkModule is loaded, alternative pointing devices are temporarily latched to the core pointer. This means that if the user moves the alternative pointing device, the on-screen pointer moves.
sv: Om Gtk-modulen <literal>dwellmouselistener</literal> är inläst hakar sig alternativa pekenheter temporärt på kärnpekaren. Detta betyder att om användaren förflyttar den alternativa pekenheten så förflyttas skärmpekaren.

source: For example, the following line starts <application>On-Screen Keyboard</application> in dwell mode when the user moves the on-screen pointer from inside the login dialog through the top edge, back into the dialog through the top edge, out of the dialog through the left edge, back into the dialog through the left edge, and similarly through the bottom and right edges of the dialog in a cross pattern:
sv: Till exempel startar följande rad <application>Skärmtangentbord</application> i uppehållsläge när användaren förflyttar skärmpekaren inifrån inloggningsdialogen via överkanten, tillbaka in i dialogrutan via överkanten, ut från dialogrutan via vänstra kanten, tillbaka in i dialogrutan genom vänstra kanten och på samma sätt genom nederkanten och högra kanterna för dialogrutan i ett korsmönster:

source: Note that the <literal>--input-device</literal> parameter specified in the gesture must match the name of the extended user input device, such as a head pointer or trackball, as specified in <filename>/etc/X11/XF86Config</filename>.
sv: Observera att parametern <literal>--input-device</literal> som anges i gesten måste matcha namnet på den utökade inmatningsenheten för användaren, såsom en huvudpekare eller styrkula (trackball), som anges i <filename>/etc/X11/XF86Config</filename>.

source: Additional Requirements for Accessible Login
sv: Ytterligare krav för hjälpmedelsinloggning

source: To enable the Accessible Login feature to use alternative pointing devices and switch devices such as sip-and-puff switches, wheelchair-mounted switches or trackballs, you might need to modify your X server system configuration to recognize these devices. You can use most devices that emulate mouse buttons with the Accessible Login feature and <application>On-Screen Keyboard</application>, including USB single switches and mouse-like pointing devices.
sv: För att funktionen Hjälpmedelsinloggning ska använda alternativa pekenheter och brytarenheter såsom en sug-och-blås-brytare, rullstolsmonterade brytare eller styrkula, så kanske du behöver ändra din systemkonfiguration för X-servern för att känna igen dessa enheter. Du kan använda de flesta enheter som kan emulera musknappar med funktionen Hjälpmedelsinloggning och <application>Skärmtangentbord</application>, inklusive enkla USB-brytare och musliknande pekenheter.

source: You should not configure an alternative input device to control the primary on-screen pointer. This might result in undesirable behavior or cause situations from which the user of the alternate input device cannot recover without using the primary keyboard or mouse. To prevent this problem, remove any occurrences of the attributes <literal>SendCore</literal> or <literal>AlwaysCore</literal> from any of the <literal>InputDevice</literal> lines in the X Server configuration file.
sv: Du bör inte konfigurera en alternativ inmatningsenhet för att kontrollera den primära skärmpekaren. Detta kan resultera i oönskat beteendet eller orsaka situationer från vilken användaren av den alternativa inmatningsenheten inte kan återställa sig utan det primära tangentbordet eller mus. För att förhindra liknande problem så ta bort alla förekomster av attribut som <literal>SendCore</literal> eller <literal>AlwaysCore</literal> från någon av <literal>InputDevice</literal>-raderna i konfigurationsfilen för X-servern.

source: Keyboard Desktop Navigation
sv: Tangentbordsnavigering

source: This section describes how to navigate the GNOME Desktop from the keyboard only. Users who have difficulty using a mouse or other pointing device can navigate and use the desktop from the keyboard.
sv: Detta avsnitt beskriver hur man navigerar i GNOME-skrivbordet endast från tangentbordet. Användare som har svårigheter med att använda en mus eller annat pekdon kan navigera och använda skrivbordet från tangentbordet.

source: Introduction to Keyboard Navigation
sv: Introduktion till tangentbordsnavigering

source: This section describes the essential keyboard shortcuts to enable you to navigate the desktop from the keyboard.
sv: Det här avsnittet beskriver de grundläggande tangentbordsgenvägarna för att låta dig navigera på skrivbordet med tangentbordet.

source: You can customize some of the keyboard shortcuts that are described in this chapter. The text indicates the shortcuts that you can customize. See <xref linkend="keynav-36"/> for information about how to customize keyboard shortcuts.
sv: Du kan anpassa några av tangentbordsgenvägarna som beskrivs i detta kapitel. Texten indikerar genvägarna som du kan anpassa. Se <xref linkend="keynav-36"/> för information om hur man anpassar tangentbordsgenvägar.

source: Essential Keyboard Shortcuts
sv: Grundläggande tangentbordsgenvägar

source: keyboard shortcuts
sv: tangentbordsgenvägar

source: essential
sv: grundläggande

source: caret navigation mode
sv: markörnavigeringsläge

source: The following table lists the essential keyboard shortcuts that you can use to navigate the desktop. The keyboard shortcuts that you use to navigate specific elements and controls are described in the appropriate sections of this chapter.
sv: Följande tabell listar de grundläggande tangentbordsgenvägarna som du kan använda för att navigera på skrivbordet. Tangentbordsgenvägarna som du kan använda för att navigera i specifik element och kontroller beskrivs i passande avsnitt i detta kapitel.

source: Keys
sv: Tangenter

source: Function
sv: Funktion

source: Tab
sv: Tabulator

source: Give focus to the next element or control.
sv: Ge fokus till nästa element eller kontroll.

source: Shift
sv: Skift

source: Reverse the navigation direction and give focus to the previous element or control. In general, the <keycap>Shift</keycap> key reverses the navigation direction.
sv: Omvänd navigeringsriktning och ge fokus till föregående element eller kontroll. I allmänhet vänder tangenten <keycap>Skift</keycap> på navigeringsriktningen.

source: Give focus to the next element or control if the <keycap>Tab</keycap> key has a specific purpose in a control. For example, if you press <keycap>Tab</keycap> in a text box, the system inserts a tab space.
sv: Ge fokus till nästa element eller kontroll om tangenten <keycap>Tabulator</keycap> har ett specifikt syfte in i kontroll. Till exempel om du trycker på <keycap>Tabulator</keycap> i en textruta så kommer systemet att infoga ett tabulatorsteg.

source: To give focus to the previous element or control, press <keycombo><keycap>Shift</keycap><keycap>Ctrl</keycap><keycap>Tab</keycap></keycombo>.
sv: Tryck på <keycombo><keycap>Skift</keycap><keycap>Ctrl</keycap><keycap>Tabulator</keycap></keycombo> för att ge fokus till föregående element eller kontroll.

source: arrow keys
sv: piltangenter

source: Navigate within an element or control.
sv: Navigera inom ett element eller kontroll.

source: spacebar
sv: blanksteg

source: Activate the element or control that has focus. For example, if the current control is a button, this action is the equivalent of clicking on the button with a mouse.
sv: Aktivera elementet eller kontrollen som har fokus. Till exempel om aktuell kontroll är en knapp så kommer denna åtgärd vara samma som att klicka på knappen med en mus.

source: Close a window, menu, or drawer.
sv: Stäng ett fönster, meny eller låda.

source: Switch to caret navigation mode. In computing, caret navigation is a kind of keyboard navigation where a caret (also known as "text cursor", "text insertion cursor", or "text selection cursor") is used to navigate and select text within a document. For more information about caret navigation mode, see <xref linkend="keynav-52"/>.
sv: Växla till markörnavigeringsläge. I datorsammanhang så är markörnavigering en typ av tangentbordsnavigering när en markör (även kallad "textmarkör", "textinmatningsmarkör" eller "textmarkeringsmarkör") används för att navigera och markera text inom ett dokument. För mer information om markörnavigeringsläget, se <xref linkend="keynav-52"/>.

source: Global Keyboard Shortcuts
sv: Globala tangentbordsgenvägar

source: The following table lists the keyboard shortcuts that you can use from any part of the GNOME Desktop.
sv: Följande tabell listar tangentbordsgenvägarna som du kan använda från alla delar av GNOME-skrivbordet.

source: Open the <guimenu>Main Applications Menu</guimenu>.
sv: Öppna <guimenu>huvudmenyn i programmet</guimenu>.

source: You can customize this keyboard shortcut.
sv: Du kan anpassa den här tangentbordsgenvägen.

source: For Solaris systems, this key is <keycap>Ctrl-Esc</keycap> (as with Microsoft Windows).
sv: För Solaris-system är denna tangent <keycap>Ctrl-Esc</keycap> (som med Microsoft Windows).

source: Open the <guilabel>Run Application</guilabel> dialog.
sv: Öppna dialogrutan <guilabel>Kör program</guilabel>.

source: For Solaris systems, this key is <keycap>Meta-R</keycap> (as with Microsoft Windows). A meta- or super-key is an OS-logo shift key.
sv: För Solaris-system så är denna tangent <keycap>Meta-R</keycap> (som med Microsoft Windows). En meta- eller super-tangent är en skifttangent med en operativsystemslogotyp.

source: Start the screenshot application and take a screenshot of the entire screen.
sv: Starta skärmbildsprogrammet och ta en skärmbild av hela skärmen.

source: Start the screenshot application and take a screenshot of the window that currently has focus.
sv: Starta skärmbildsprogrammet och ta en skärmbild av fönstret som har fokus.

source: If the focused element is an application window or dialog, this keyboard shortcut opens the Help for the application.
sv: Om det fokuserade elementet är ett programfönster eller dialogruta så kommer denna tangentbordsgenväg att öppna Hjälp för programmet.

source: If the focused element is a panel or application window, this keyboard shortcut switches the display of tooltips for the window or panel objects on and off.
sv: Om det fokuserade elementet är en panel eller programfönster så kommer denna tangentbordsgenväg att växla visningen av verktygstips för fönstret eller panelobjektet.

source: Open a popup menu for the element that has focus (if a popup menu exists for that element).
sv: Öppna en popupmeny för elementet som har fokus (om en popupmeny finns för det elementet).

source: Navigating the Desktop Background
sv: Navigera i skrivbordsbakgrunden

source: for desktop background
sv: för skrivbordsbakgrund

source: The desktop background is the part of the GNOME Desktop where there are no interface items or applications, such as panels and windows. The following table lists the keyboard shortcuts that you can use to navigate the desktop background and the desktop background objects. A desktop background object is an icon on the desktop background that you can use to open files, folders, or applications.
sv: Skrivbordsbakgrunden är den del av GNOME-skrivbordet som det inte finns några gränssnittsobjekt eller program, såsom paneler och fönster. Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera på skrivbordsbakgrunden och objekt på skrivbordsbakgrunden. Ett skrivbordsbakgrundsobjekt är en ikon på skrivbordsbakgrunden som du kan använda för att öppna filer, mappar eller program.
