Repository: eurolinux-enterprise-linux-sources/gnome-user-docs
Catalog: src/gnome2-accessibility-guide/*/*.po
Languages: sv

source: Temporarily hide all windows and give focus to the desktop background.
sv: Dölj alla fönster temporärt och ge fokus till skrivbordsbakgrunden.

source: To restore the windows, press <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>D</keycap></keycombo> again.
sv: Tryck på <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>D</keycap></keycombo> igen för att återställa fönstren.

source: For Solaris systems, this key is <keycap>Meta-D</keycap> (as with Microsoft Windows). A meta- or super-key is an OS-logo shift key.
sv: För Solaris-system så är denna tangent <keycap>Meta-D</keycap> (som med Microsoft Windows). En meta- eller super-tangent är en skift-tangent med en operativsystemslogotyp.

source: Display a popup window with icons that represent the desktop background and the panels. Press and hold <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap></keycombo> and continue to press <keycap>Tab</keycap> to switch the focus between the desktop background and the panels.
sv: Visa ett popupfönster med ikoner som representerar skrivbordsbakgrunden och panelerna. Tryck och håll ner <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap></keycombo> och fortsätt att trycka på <keycap>Tabulator</keycap> för att växla fokus mellan skrivbordsbakgrunden och panelerna.

source: Give focus to a neighboring desktop background object (if the desktop has focus).
sv: Ge fokus till ett närliggande skrivbordsbakgrundsobjekt (om skrivbordet har fokus).

source: A sequence of characters that matches the first <replaceable>n</replaceable> characters of a desktop background object name.
sv: En teckensekvens som matchar de första <replaceable>n</replaceable> tecknen i namnet på ett skrivbordsbakgrundsobjekt.

source: If the desktop background has focus, give focus to the desktop background object whose name starts with the specified sequence of characters.
sv: Om skrivborsdbakgrunden har fokus så ge fokus till skrivbordsbakgrundsobjektet vars namn börjar med den angivna teckensekvensen.

source: Rename the desktop background object that has focus.
sv: Byt namn på skrivbordsbakgrundsobjektet som har fokus.

source: Open the popup menu for the desktop background object that has focus.
sv: Öppna popupmenyn för skrivbordsbakgrundsobjektet som har fokus.

source: Open the <guimenu>Desktop Background</guimenu> menu.
sv: Öppna menyn <guimenu>Skrivbordsbakgrund</guimenu>.

source: Navigating Panels
sv: Navigera i paneler

source: for panels
sv: för paneler

source: A panel is an area from which you can run special programs, applications, and panel applications. The most common panel is the panel that stretches the full width of the bottom edge of the desktop. The following table lists the keyboard shortcuts that you can use to navigate panels and panel objects.
sv: En panel är ett område från vilket du kan köra speciella program och panelprogram. Den mest vanliga panelen är panelen som sträcker sig längs hela nederkanten av skrivbordet. Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera i paneler och panelobjekt.

source: Give focus to a panel. This keyboard shortcut displays a popup window with icons that represent the desktop background, panels, and drawers. Press and hold <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap></keycombo> and continue to press <keycap>Tab</keycap> to switch the focus between the desktop background, panels, and drawers. If you're especially dexterous, you can add <keycap>Shift</keycap> to go in reverse.
sv: Ge fokus till en panel. Denna tangentbordsgenväg visar ett popupfönster med ikoner som representerar skrivbordsbakgrunden, panelerna och lådorna. Tryck och håll ner <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap></keycombo> och fortsätt att trycka på <keycap>Tabulator</keycap> för att växla fokus mellan skrivbordsbakgrunden, panelerna och lådorna. Om du är fingerfärdig så kan du lägga till <keycap>Skift</keycap> för att gå i omvänd riktning.

source: Give focus to the next object on the panel.
sv: Ge fokus till nästa objekt på panelen.

source: Open the <guimenu>Applications</guimenu> menu when the Menu Panel has focus. Continue to press <keycap>F10</keycap> to switch focus between the <guimenu>Applications</guimenu> menu and the window list. This key behavior may alter slightly depending on context and specific user setup.
sv: Öppna menyn <guimenu>Program</guimenu> när Meny-panelen har fokus. Fortsätt att trycka på <keycap>F10</keycap> för att växla fokus mellan menyn <guimenu>Program</guimenu> och fönsterlisten. Detta tangentbeteende kan skilja sig lite beroende på sammanhang och specifik användarkonfiguration.

source: Activate a panel object; for example, open a menu or start a launcher (icon shortcut).
sv: Aktivera ett panelobjekt; till exempel, öppna en meny eller starta en programstartare (ikongenväg).

source: Open the panel object popup menu.
sv: Öppna panelobjektets popupmeny.

source: Open the panel popup menu.
sv: Öppna panelens popupmeny.

source: Moving Panel Objects
sv: Flytta panelobjekt

source: to move a panel object
sv: för att flytta ett panelobjekt

source: You can move a focused panel object to a different location on a panel or drawer, or you can move the object to the next panel. To move a panel object, perform the following steps:
sv: Du kan flytta ett panelobjekt med fokus till en annan plats i en panel eller låda eller flytta objektet till nästa panel. Genomför följande steg för att flytta ett panelobjekt:

source: Press <keycap>Tab</keycap> to give focus to the object.
sv: Tryck på <keycap>Tabulator</keycap> för att ge fokus till objektet.

source: Press <keycombo><keycap>Shift</keycap><keycap>F10</keycap></keycombo> to open the panel object popup menu.
sv: Tryck på <keycombo><keycap>Skift</keycap><keycap>F10</keycap></keycombo> för att öppna panelobjektets popupmeny.

source: Use the arrow keys to select the <guimenuitem> Move</guimenuitem> menu item.
sv: Använd piltangenterna för att välja menyobjektet <guimenuitem> Flytta</guimenuitem>.

source: Use the keyboard shortcuts that are listed in the following table to perform the move operation:
sv: Använd tangentbordsgenvägarna som listas i följande tabell för att genomför flyttningsåtgärden:

source: Move the object left/right on a horizontal panel, or up/down on a vertical panel.
sv: Flytta objektet åt vänster/höger på en horisontell panel eller upp/ned på en vertikal panel.

source: <keycap>Shift</keycap> + arrow keys
sv: <keycap>Skift</keycap> + piltangenter

source: Move the object with focus, swapping positions with any other objects encountered.
sv: Flytta objektet med fokus, byt positioner med andra objekt som påträffas.

source: <keycap>Ctrl</keycap> + arrow keys
sv: <keycap>Ctrl</keycap> + piltangenter

source: Move the object, swapping positions with any other objects that you encounter in the move.
sv: Flytta objektet, byt positioner med andra objekt som du påträffar vid flyttningen.

source: Move the object to the next panel.
sv: Flytta objektet till nästa panel.

source: Complete the move operation.
sv: Färdigställ flyttningsåtgärden.

source: The following examples demonstrate the effect of different move operations on the objects in a panel:
sv: Följande exempel demonstrerar effekten för olika förflyttningsåtgärder på objekten i en panel:

source: Description
sv: Beskrivning

source: Volume Control
sv: Volymkontroll

source: Help
sv: Hjälp

source: Portion of a panel with three objects displayed in the following order from left to right: <placeholder-1/> icon, <placeholder-2/> icon, and <placeholder-3/> icon.
sv: Del av en panel med tre objekt som visas i följande ordning från vänster till höger: <placeholder-1/>-ikon, <placeholder-2/>-ikon och <placeholder-3/>-ikon.

source: Show a panel with three panel objects before a move operation takes place.
sv: Visa en panel med tre panelobjekt innan en förflyttningsåtgärd sker.

source: Shows the effect of using the arrow keys to move the <application>Geyes</application> panel application on the panel. You can use the arrow keys to move the panel application left or right until you meet the next panel object.
sv: Visar effekten av att använda piltangenterna för att förflytta panelprogrammet <application>Geyes</application> på panelen. Du kan använda piltangenterna för att förflytta panelprogrammet vänster eller höger tills du träffar nästa panelobjekt.

source: Shows the effect of using <keycap>Shift</keycap> + arrow keys to move the <application>Geyes</application> panel application on the panel. You can use the <keycap>Shift</keycap> + arrow keys to push the <application>Volume Control</application> and <application>Help</application> panel objects ahead of the object that you are moving.
sv: Visar effekten av att använda <keycap>Skift</keycap> + piltangenterna för att förflytta panelprogrammet <application>Geyes</application> på panelen. Du kan använda <keycap>Skift</keycap> + piltangenter för att trycka panelobjekten <application>Volymkontroll</application> och <application>Hjälp</application> framför objektet som du förflyttar.

source: Shows the effect of using <keycap>Ctrl</keycap> + arrow keys to move the <application>Geyes</application> panel application on the panel. You can use the <keycap>Ctrl</keycap> + arrow keys to swap positions with the <application>Volume Control</application> and <application>Help</application> panel objects as you meet the objects.
sv: Visar effekten av att använda <keycap>Ctrl</keycap> + piltangenterna för att förflytta panelprogrammet <application>Geyes</application> på panelen. Du kan använda <keycap>Ctrl</keycap> + piltangenter för att växla positioner med panelobjekten <application>Volymkontroll</application> och <application>Hjälp</application> när du möter objekten.

source: Panel applications that are <guilabel>Locked</guilabel> cannot be moved. To unlock a panel application, use the <guimenu>panel object</guimenu> menu and deselect the <guimenuitem>Lock to Panel</guimenuitem> option.
sv: Panelprogram som är <guilabel>låsta</guilabel> kan inte förflyttas. För att låsa upp ett panelprogram så använd <guimenu>panelobjektets</guimenu> meny och avmarkera alternativet <guimenuitem>Lås till panel</guimenuitem>.

source: Navigating Drawers
sv: Navigera i lådor

source: for drawers
sv: för lådor

source: A drawer is a collapsible extension of a panel. The following table lists the keyboard shortcuts that you can use to navigate into and out of drawers. When you open a drawer, you can navigate the contents of the drawer in the same way as you navigate a panel. See <xref linkend="keynav-5"/> for information about how to navigate a panel.
sv: En låda är en utdragbar utökning av en panel. Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera in och ut i lådor. När du öppnar en låda så kan du navigera i lådans innehåll på samma sätt som om du navigerade i en panel. Se <xref linkend="keynav-5"/> för information om hur man navigerar i en panel.

source: Open or close the drawer that has focus.
sv: Öppna eller stäng lådan som har fokus.

source: Navigate into the drawer that has focus.
sv: Navigera in i lådan som har fokus.

source: Close the drawer and give focus to the drawer object on the panel.
sv: Stäng lådan och ge fokus till lådobjektet på panelen.

source: Navigating Panel Menus
sv: Navigera i panelmenyer

source: for menus on panels
sv: för menyer på paneler

source: The following table lists the keyboard shortcuts that you can use to navigate menus on panels:
sv: Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera i menyer på paneler:

source: Open the menu that has focus.
sv: Öppna menyn som har fokus.

source: Navigate the menu.
sv: Navigera i menyn.

source: Select a menu item.
sv: Välj ett menyobjekt.

source: Open the popup menu associated with a menu item (if one exists).
sv: Öppna popupmenyn som är associerad med ett menyobjekt (om det finns en).

source: Close a menu.
sv: Stäng en meny.

source: Navigating Panel Applications
sv: Navigera i panelprogram

source: for panel applications
sv: för panelprogram

source: A panel application is a small application that resides on a panel. You can navigate to all panel applications and open the panel application popup menu from the keyboard. However, if the panel application does not contain controls that you can give focus to, you cannot navigate the controls in the panel application. The following table lists the keyboard shortcuts that you can use to navigate panel applications.
sv: Ett panelprogram är ett litet program som lever i en panel. Du kan navigera till alla panelprogram och öppna panelprogrammets popupmeny från tangentbordet. Dock, om panelprogrammet inte har kontroller som du kan ge fokus till, så kan du inte navigera i kontrollerna i panelprogrammet. Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera i panelprogram.

source: Activate the panel application control that has focus, if applicable. Not all panel applications contain controls that you can activate. If the panel application does not contain a control that you can activate, the <keycap>spacebar</keycap> does nothing.
sv: Aktivera panelprogrammets kontroll som har fokus, om möjligt. Inte alla panelprogram innehåller kontroller som du kan aktivera. Om panelprogrammet inte har en kontroll som du kan aktivera så gör <keycap>blanksteg</keycap> ingenting.

source: Navigate the controls on the panel application.
sv: Navigera i kontrollerna för panelprogrammet.

source: Open the panel application popup menu. To navigate the menu, use the standard keyboard shortcuts for navigating menus. See <xref linkend="keynav-24"/> for information about how to navigate menus.
sv: Öppna panelprogrammets popupmeny. För att navigera i menyn, använd standardgenvägarna för tangentbordet för att navigera i menyerna. Se <xref linkend="keynav-24"/> för information om hur man navigerar i menyer.

source: Navigating Workspaces
sv: Navigera i arbetsytor

source: for workspaces
sv: för arbetsytor

source: A workspace is a discrete area in which you can work. You can have many workspaces on your desktop and you can switch from one workspace to another. Each workspace can contain different windows and processes. The following table lists the keyboard shortcuts that you can use to navigate workspaces:
sv: En arbetsyta är ett avskilt område i vilket du kan arbeta. Du kan ha många arbetsytor på ditt skrivbord och du kan växla från en arbetsyta till en annan. Varje arbetsyta kan innehålla olika fönster och processer. Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera i arbetsytor:

source: <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap></keycombo> + arrow keys
sv: <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap></keycombo> + piltangenter

source: Give focus to the next or previous workspace. This keyboard shortcut displays a popup window with icons that represent the workspaces. Press and hold <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap></keycombo> and continue to press the arrow keys to switch the focus between the workspaces.
sv: Ge fokus till nästa eller föregående arbetsyta. Denna tangentbordsgenväg visar ett popupfönster med ikoner som representerar arbetsytorna. Tryck och håll ner <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap></keycombo> och fortsätt med att trycka på piltangenterna för att växla fokus mellan arbetsytorna.

source: <keycombo><keycap>Ctrl</keycap><keycap>Shift</keycap><keycap>Alt</keycap></keycombo> + arrow keys
sv: <keycombo><keycap>Ctrl</keycap><keycap>Skift</keycap><keycap>Alt</keycap></keycombo> + piltangenter

source: Move the window that has focus to the next or previous workspace.
sv: Förflytta fönstret som har fokus till nästa eller föregående arbetsyta.

source: Navigating Windows
sv: Navigera i fönster

source: for windows
sv: för fönster

source: The following sections describe the keyboard shortcuts that you can use to navigate windows. A window is a rectangular frame on your screen that displays an application.
sv: Följande avsnitt beskriver tangentbordsgenvägarna som du kan använda för att navigera i fönster. Ett fönster är en rektangulär ruta på din skärm som visar ett program.

source: You can customize all of the keyboard shortcuts that are associated with navigating windows. See <xref linkend="keynav-10"/> for more information.
sv: Du kan anpassa alla tangentbordsgenvägar som är associerade med att navigera i fönster. Se <xref linkend="keynav-10"/> för mer information.

source: Giving Focus to Windows
sv: Ge fokus till fönster

source: to give focus to a window
sv: för att ge fokus till ett fönster

source: Before you can use or modify a window, you must give focus to the window. The following table lists the keyboard shortcuts that you can use to give focus to a window:
sv: Innan du kan använda eller ändra ett fönster så måste du ge fokus till fönstret. Följande tabell listar tangentbordsgenvägarna som du kan använda för att ge fokus till ett fönster:

source: Display a popup window with icons that represent each window. Press and hold <keycap>Alt</keycap> and continue to press <keycap>Tab</keycap> to move through the windows until you reach the window you want to have focus.
sv: Visa ett popupfönster med ikoner som representerar varje fönster. Tryck och håll ner <keycap>Alt</keycap> och fortsätt med att trycka på <keycap>Tabulator</keycap> för att förflytta dig mellan fönstren tills du når fram till fönstret som du vill ska ha fokus.

source: Raise each window in turn until you reach the window you want.
sv: Höj varje fönster i tur och ordning tills du når fram till fönstret som du vill ha.

source: Cycle between windows belonging to the current application (eg, a multiple document interface application like <application>Text Editor</application>).
sv: Växla mellan fönster som tillhör samma program (t.ex. ett program som innehåller flera dokument såsom <application>Textredigerare</application>).

source: Controlling Windows
sv: Kontrollera fönster

source: to control a window
sv: för att kontrollera ett fönster

source: When a window has focus, you can perform various actions on the window. The following table lists the keyboard shortcuts that you can use to control the window that has focus:
sv: När ett fönster har fokus så kan du genomföra olika åtgärder på fönstret. Följande tabell listar tangentbordsgenvägarna som du kan använda för att kontrollera fönstret som har fokus.

source: Open the <guimenu>Window</guimenu> menu.
sv: Öppna menyn <guimenu>Fönster</guimenu>.

source: Close the window.
sv: Stäng fönstret.

source: Minimize the window.
sv: Minimera fönstret.

source: Maximize the window.
sv: Maximera fönstret.

source: Restore a maximized window to its original size.
sv: Återställ ett maximerat fönster till dess ursprungliga storlek.

source: Moving Windows
sv: Flytta fönster

source: to move a window
sv: för att flytta ett fönster

source: When a window has focus, you can move the window around the screen. The following table lists the keyboard shortcuts that you can use to move a window:
sv: När ett fönster har fokus så kan du flytta fönstret runt på skärmen. Följande tabell listar tangentbordsgenvägarna som du kan använda för att flytta ett fönster:

source: Start the move operation. The mouse pointer changes to a cross.
sv: Starta förflyttningsåtgärden. Muspekaren ändras till ett kors.

source: Move the window 10 pixels at a time in the direction of the arrow key.
sv: Flytta fönstret 10 bildpunkter åt gången i riktningen för piltangenten.

source: Move the window one pixel at a time in the direction of the arrow key.
sv: Flytta fönstret en bildpunkt åt gången i riktningen för piltangenten.

source: Move the window in the direction of the arrow key and align it with the edge of the nearest window, panel or screen edge.
sv: Flytta fönstret i riktningen för piltangenten och justera den längs kanten på närmsta fönster, panel eller skärmkant.

source: Complete the move operation, leaving the window in the current position.
sv: Färdigställ förflyttningsåtgärden, lämna fönstret i den aktuella positionen.

source: Cancel the move operation, restoring the window to its original position.
sv: Avbryt förflyttningsåtgärden, återställ fönstret till dess ursprungliga position.

source: Resizing Windows
sv: Ändra storlek på fönster

source: to resize a window
sv: för att ändra storlek på ett fönster

source: When a window has focus, you can increase or decrease the size of the window. The following table lists the keyboard shortcuts that you can use to resize the window that has focus:
sv: När ett fönster har fokus så kan du öka eller minska storleken på fönstret. Följande tabell listar tangentbordsgenvägarna som du kan använda för att ändra storleken på fönstret som har fokus:

source: Start the resize operation.
sv: Starta storleksändringsåtgärden.

source: Resize the window in the direction of the arrow key.
sv: Ändra storlek på fönstret i riktningen för piltangenten.

source: Complete the resize operation, leaving the window at the current size.
sv: Färdigställ storleksändringsåtgärden, lämna fönstret i den aktuella storleken.

source: Cancel the resize operation, restoring the window to its original size.
sv: Avbryt storleksändringsåtgärden, återställ fönstret till dess ursprungliga storlek.

source: Navigating Paned Windows
sv: Navigera i fönsterpaneler

source: for paned windows
sv: för fönster med paneler

source: A paned window is a window that is split into two or more panes. <application>Help Browser</application> is an example of an application that uses paned windows.
sv: Ett panelfönster är ett fönster som är uppdelat i två eller flera paneler. <application>Hjälpbläddrare</application> är ett exempel på ett program som använda panelfönster.

source: The following table describes the keyboard shortcuts that you can use to navigate paned/split windows:
sv: Följande tabell beskriver tangentbordsgenvägarna som du kan använda för att navigera i delade fönster (paneler).

source: Give focus to the next pane. The system gives focus to the control that last had focus in the pane.
sv: Ge fokus till nästa panel. Systemet ger fokus till kontrollen som senast hade fokus i panelen.

source: Give focus to the first resize handle in the window. The resize handle is displayed between the panes and enables you to resize the panes. Press <keycap>F8</keycap> again to give focus to the next resize handle.
sv: Ge fokus till första storleksändringshandtaget i fönstret. Storleksändringshandtaget visas mellan panelerna och låter dig ändra storlek på panelerna. Tryck på <keycap>F8</keycap> igen för att ge fokus till nästa storleksändringshandtag.

source: When the resize handle has focus, you can use the keyboard shortcuts that are listed in the following table to modify the paned window:
sv: Du kan använda tangentbordsgenvägarna som listas i följande tabell för att ändra panelfönstret när storleksändringshandtaget har fokus:

source: Move the resize handle by a small amount.
sv: Flytta storleksändringshandtaget lite.

source: Move the resize handle by a large amount.
sv: Flytta storleksändringshandtaget mycket.

source: Contract the pane to the minimum size allowed.
sv: Förminska panelen till den minsta tillåtna storleken.

source: For vertical panes, reduces the size of the pane to the left of the resize handle to the minimum size allowed.
sv: För vertikala paneler minskas storleken på panelen till vänster om storleksändringshandtaget till den minsta tillåtna storleken.

source: For horizontal panes, reduces the size of the pane above the resize handle to the minimum size allowed.
sv: För horisontella paneler minskas storleken på panelen ovanför storleksändringshandtaget till den minsta tillåtna storleken.
