Repository: eurolinux-enterprise-linux-sources/gnome-user-docs
Catalog: src/gnome2-accessibility-guide/*/*.po
Languages: sv

source: <keycombo><keycap>Caps_Lock</keycap><keycap>Alt</keycap><keycap>Ctrl</keycap><keycap>End</keycap></keycombo> - prints a debug listing of all known applications to the console where <application>Orca</application> is running.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>Alt</keycap><keycap>Ctrl</keycap><keycap>End</keycap></keycombo> - skriver ut en felsökningslistning över alla kända program till konsollen där <application>Orca</application> körs.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>Alt</keycap><keycap>Ctrl</keycap><keycap>Page_Up</keycap></keycombo> - prints debug information about the ancestry of the object with focus.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>Alt</keycap><keycap>Ctrl</keycap><keycap>Page_Up</keycap></keycombo> - skriver ut felsökningsinformation om ursprunget till objektet med fokus.

source: <keycombo><keycap>Caps_Lock</keycap><keycap>Alt</keycap><keycap>Ctrl</keycap><keycap>Page_Down</keycap></keycombo> - prints debug information about the object hierarchy of the application with focus.
sv: <keycombo><keycap>Caps_Lock</keycap><keycap>Alt</keycap><keycap>Ctrl</keycap><keycap>Page_Down</keycap></keycombo> - skriver ut felsökningsinformation om objekthierarkin för programmet med fokus.

source: Application-Specific Information
sv: Programspecifik information

source: Accessible Applications
sv: Hjälpmedelsprogram

source: Making Application-Specific Settings
sv: Gör programspecifika inställningar

source: Braille
sv: Punktskrift

source: <application>Orca</application> uses <ulink url="http://mielke.cc/brltty/">BrlTTY</ulink> for braille support. On Linux systems, BrlTTY is used to access the text mode console content. On a typical braille-enabled installation of Linux, BrlTTY is already running and providing access to the text consoles. When Orca starts, it connects to BrlTTY. If you switch from a text console to your X Windows session, your braille display will automatically follow and display the content that Orca is presenting to you.
sv: <application>Orca</application> använder <ulink url="http://mielke.cc/brltty/">BrlTTY</ulink> för punktskriftsstöd. På Linux-system används BrlTTY för att komma åt innehåll i textlägeskonsollen. På en vanlig punktskriftsaktiverad installation av Linux körs redan BrlTTY och tillhandahåller åtkomst till textkonsoller. När Orca startar så ansluter den till BrlTTY. Om du växlar från en textkonsoll till din X Windows-session kommer din punktskriftsdisplay att automatiskt följa med och visa innehållet som Orca visar för dig.

source: <application>Orca</application> attempts to work with various releases of BrlTTY. It works well with BrlTTY v3.7.2, and we've also been working with the BrlTTY team to get it going for BrlTTY v3.8. The remainder of this document provides information related to using <application>Orca</application> with <application>BrlTTY</application> 3.8.
sv: <application>Orca</application> försöker att arbeta med olika utgåvor av BrlTTY. Det fungerar mycket bra med BrlTTY v3.7.2 och vi har även arbetat med BrlTTY-teamet för att få det att fungera med BrlTTY v3.8. Resten av detta dokument tillhandahåller information relaterad till användningen av <application>Orca</application> med <application>BrlTTY</application> 3.8.

source: Below are descriptions of the necessary tasks to install/setup BrlTTY in Ubuntu and Solaris. For both, you need to first obtain <ulink url="http://mielke.cc/brltty/releases/ brltty-3.8.tar.gz">brltty-3.8.tar.gz</ulink> from the BrlTTY site.
sv: Nedan är beskrivningar av de nödvändiga uppgifterna för att installera/konfigurera BrlTTY i Ubuntu och Solaris. För båda så behöver du först hämta ner <ulink url="http://mielke.cc/brltty/releases/ brltty-3.8.tar.gz">brltty-3.8.tar.gz</ulink> från webbplatsen för BrlTTY.

source: BrlTTY 3.8 on Ubuntu
sv: BrlTTY 3.8 på Ubuntu

source: First, configure your build environment to build BrlTTY. Much of this setup is done for you automatically in the Ubuntu distribution with products such as G++ already present. In addition, <emphasis>you must</emphasis> also install tcl, Pyrex, and the Python developer environment. To do this, execute the following commands as <userinput>root</userinput>:
sv: Konfigurera först din byggmiljö för att bygga BrlTTY. Mycket av denna konfiguration görs automatiskt åt dig i Ubuntu-distributionen med redan installerade produkter såsom G++. I tillägg <emphasis>måste du</emphasis> även installera tcl, Pyrex samt utvecklingsmiljön Python. Kör följande kommandon som <userinput>root</userinput> för att installera dessa:

source: Then, when you build BrlTTY, avoid configuring the package with --prefix=/usr. Use the standard procedure instead, executing the following commands as <userinput>root</userinput>:
sv: När du sedan bygger BrlTTY så bör du undvika att konfigurera paketet med --prefix=/usr. Använd standardproceduren istället och kör följande kommandon som <userinput>root</userinput>:

source: Run BrlTTY as <userinput>root</userinput>:
sv: Kör BrlTTY som <userinput>root</userinput>:

source: If you want, you can remove the existing <userinput>/sbin/brltty</userinput> and replace it with the <userinput>/bin/brltty</userinput>, either by copying the <userinput>/bin/brltty</userinput> to <userinput>/sbin/brltty</userinput> or just by making a symbolic link. Do so at your own risk.
sv: Om du vill så kan du ta bort den befintliga <userinput>/sbin/brltty</userinput> och ersätta den med <userinput>/bin/brltty</userinput>, antingen genom att kopiera <userinput>/bin/brltty</userinput> till <userinput>/sbin/brltty</userinput> eller helt enkelt genom att skapa en symbolisk länk. Gör så på din egen risk.

source: Troubleshooting
sv: Problemlösning

source: My desktop has stopped responding. What do I do?
sv: Mitt skrivbord har slutat att svara. Vad kan jag göra?

source: If you cannot get to a terminal window, try pressing <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Backspace</keycap></keycombo>: shut down the X Window System server. This should return you to the login screen.
sv: Om du inte kan komma till ett terminalfönster så prova att trycka <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>Backsteg</keycap></keycombo>: stäng av X Window System-servern. Detta ska göra att du kommer tillbaka till inloggningsskärmen.

source: Mobility Impairments
sv: Rörelsehinder

source: <emphasis>On-Screen Keyboard</emphasis> - lets users select keys using a pointing method such as pointing devices, switches, or Morse-code input systems.
sv: <emphasis>Skärmtangentbord</emphasis> - låter användare välja tangenter genom att använda en pekmetod såsom pekenheter, brytare eller inmatning via morsekod.

source: GNOME On-Screen Keyboard (gok)
sv: GNOME-skärmtangentbord (gok)

source: On-Screen Keyboard
sv: Skärmtangentbord

source: You must enable the assistive technology services before you are able to use many of the accessibility tools available.
sv: Du måste aktivera tjänster för hjälpmedelstekniker innan du kan använda många av de hjälpmedelsverktygen som finns tillgängliga.

source: Choose <menuchoice><guimenuitem>System</guimenuitem><guimenuitem>Preferences</guimenuitem><guimenuitem>Assistive Technologies</guimenuitem></menuchoice>.
sv: Välj <menuchoice><guimenuitem>System</guimenuitem><guimenuitem>Inställningar</guimenuitem><guimenuitem>Hjälpmedelsteknik</guimenuitem></menuchoice>.

source: Select <guilabel>Enable assistive technologies </guilabel> and then press <guibutton>Close and Log Out</guibutton>.
sv: Välj <guilabel>Aktivera hjälpmedelsfunktioner</guilabel> och tryck sedan på <guibutton>Stäng och logga ut</guibutton>.

source: Log back in. The assistive technology services will be started automatically.
sv: Logga sedan in igen. Tjänster för hjälpmedelstekniker kommer automatiskt att startas.

source: Maximizing Application Windows for On-Screen Keyboard Users
sv: Maximera programfönster för användare med skärmtangentbord

source: maximizing Terminal On-Screen Keyboard
sv: maximerar terminalens skärmtangentbord

source: If you are an <application>On-Screen Keyboard </application> user, you cannot use any application in Full-Screen mode because the application window obscures the <application>On-Screen Keyboard</application> display.
sv: Om du använder <application>Skärmtangentbord </application> så kan du inte använda några program i helskärmsläget därför att programfönstret täcker fönstret för <application>Skärmtangentbord</application>.

source: To resize the window for use with the <application>On-Screen Keyboard</application> application, perform the following steps:
sv: Genomför följande steg för att ändra storlek på fönstret för att använda det med programmet <application>Skärmtangentbord</application>:

source: Do not enable the Full-Screen mode in the application.
sv: Aktivera inte helskärmsläget i programmet.

source: Give focus to the application window.
sv: Ge fokus till programfönstret.

source: Press <keycap>F10</keycap> to maximize the application.
sv: Tryck på <keycap>F10</keycap> för att maximera programmet.

source: Mouse and Keyboard Enhancements
sv: Mus- och tangentbordsförbättringar

source: This section describes how to configure the mouse and keyboard to make these devices accessible to more users.
sv: Det här avsnittet beskriver hur man konfigurerar mus och tangentbord för att göra dessa enheter tillgängliga för fler användare.

source: Configuring the Mouse
sv: Konfigurera musen

source: Use the <guilabel>Mouse</guilabel> preference tool to configure the mouse to suit your needs. To open the <guilabel>Mouse</guilabel> preference tool, choose <menuchoice><guimenu>System</guimenu><guisubmenu>Preferences</guisubmenu><guimenuitem>Mouse </guimenuitem></menuchoice>. The <guilabel> Mouse Preferences</guilabel> dialog is displayed.
sv: Använd inställningsverktyget <guilabel>Mus</guilabel> för att konfigurera musen till att passa dina behov. För att öppna inställningsverktyget <guilabel>Mus</guilabel>, välj <menuchoice><guimenu>System</guimenu><guisubmenu>Inställningar</guisubmenu><guimenuitem>Mus</guimenuitem></menuchoice>. Dialogrutan <guilabel> Musinställningar</guilabel> kommer att visas.

source: Configuring Mouse Behavior
sv: Konfigurera musbeteendet

source: The following sections describe how to modify the behavior of the mouse to suit your needs.
sv: Följande avsnitt beskriver hur man ändrar beteendet för musen för att passa dina behov.

source: Configuring the Mouse for Left-Handed Use
sv: Konfigurera musen för vänsterhänt användning

source: mouse
sv: mus

source: left hand
sv: vänsterhänt

source: Configuring Double-Click Behavior
sv: Konfigurera dubbelklicksbeteendet

source: double-click behavior
sv: dubbelklicksbeteende

source: Changing Mouse Pointer Size
sv: Ändra storleken för muspekaren

source: pointer size
sv: storlek på pekare

source: pointer
sv: pekare

source: size
sv: storlek

source: Click on the <guilabel>Pointers</guilabel> tab in the <guilabel>Mouse Preferences</guilabel> dialog.
sv: Klicka på fliken <guilabel>Pekare</guilabel> i dialogrutan <guilabel>Musinställningar</guilabel>.

source: Locating the Mouse Pointer
sv: Lokalisera muspekaren

source: locating pointer
sv: lokalisera pekare

source: Configuring Mouse Speed and Sensitivity
sv: Konfigurera hastighet och känslighet för musen

source: speed and sensitivity
sv: hastighet och känslighet

source: To configure the speed and sensitivity of the mouse, perform the following steps:
sv: Genomför följande steg för att konfigurera hastighet och känslighet för musen:

source: Configure the following options:
sv: Konfigurera följande alternativ:

source: Acceleration
sv: Accelerering

source: Sensitivity
sv: Känslighet

source: Threshold
sv: Tröskelvärde

source: Configuring the Cursor
sv: Konfigurera markören

source: cursor
sv: markör

source: stop blinking
sv: stoppa blinkning

source: The following section describes how to modify the display characteristics of the cursor.
sv: Följande avsnitt beskriver hur man ändrar visningsegenskaperna för pekaren.

source: Stopping the Cursor from Blinking
sv: Stoppa markörblinkningen

source: To stop the cursor from blinking in text boxes and other areas, perform the following steps:
sv: Genomför följande steg för att stoppa markören från att blinka i textrutor och andra områden:

source: Choose <menuchoice><guimenu>System</guimenu><guisubmenu>Preferences</guisubmenu><guimenuitem>Keyboard</guimenuitem></menuchoice> to start the <application>Keyboard</application> preference tool.
sv: Välj <menuchoice><guimenu>System</guimenu><guisubmenu>Inställningar</guisubmenu><guimenuitem>Tangentbord</guimenuitem></menuchoice> för att starta inställningsverktyget <application>Tangentbord</application>.

source: Keyboard Mouse Emulation
sv: Mus-emulering med tangentbord

source: Configuring an Accessible Keyboard
sv: Konfigurera ett hjälpmedelstangentbord

source: Use the <application>Keyboard</application> preference tool to configure the keyboard accessibility options. To open the <application>Keyboard</application> preference tool, choose <menuchoice><guimenu>System </guimenu><guisubmenu>Preferences</guisubmenu><guimenuitem>Keyboard</guimenuitem></menuchoice>. Accessibility options can be enabled by selecting the <guilabel>Accessibility</guilabel> tab.
sv: Använd inställningsverktyget <guilabel>Tangentbord</guilabel> för att konfigurera alternativ för tangentbordshjälpmedel. För att öppna inställningsverktyget <guilabel>Tangentbord</guilabel>, välj <menuchoice><guimenu>System</guimenu><guisubmenu>Inställningar</guisubmenu><guimenuitem>Tangentbord</guimenuitem></menuchoice>. Alternativ för hjälpmedel kan aktiveras genom att välja fliken <guilabel>Hjälpmedel</guilabel>.

source: The <guilabel>Accessibility</guilabel> tabbed section allows the following options:
sv: Fliksektionen <guilabel>Hjälpmedel</guilabel> tillåter följande alternativ:

source: Configuring a Keyboard-Based Mouse
sv: Konfigurera en tangentbordsbaserad mus

source: Use the <application>Keyboard</application> preference tool to configure the keyboard to simulate a mouse. To open the <application>Keyboard</application> preference tool, choose <menuchoice><guimenu>System </guimenu><guisubmenu>Preferences</guisubmenu><guimenuitem>Keyboard</guimenuitem></menuchoice>. The Mouse Keys options can be enabled by selecting the <guilabel>Mouse Keys</guilabel> tab.
sv: Använd inställningsverktyget <guilabel>Tangentbord</guilabel> för att konfigurera tangentbordet till att simulera en mus. För att öppna inställningsverktyget <guilabel>Tangentbord</guilabel>, välj <menuchoice><guimenu>System</guimenu><guisubmenu>Inställningar</guisubmenu><guimenuitem>Tangentbord</guimenuitem></menuchoice>. Alternativet Mustangenter kan aktiveras genom att välja fliken <guilabel>Mustangenter</guilabel>.

source: <emphasis>"Allow to control the pointer using the keyboard" (Alt-A)</emphasis> - this determines if the keyboard can be used to control the mouse pointer.
sv: <emphasis>"Tillåt styrning av muspekaren med tangentbordet" (Alt-M)</emphasis> - denna bestämmer om tangentbordet kan användas för att styra muspekaren.

source: <emphasis>Acceleration (Alt-C)</emphasis> - determines how quickly mouse motion will accelerate when keyboard directional keys are pressed.
sv: <emphasis>Acceleration (Alt-C)</emphasis> - bestämmer hur snabbt musrörelsen ska accelerera när tangentbordets riktningstangenter trycks ned.

source: <emphasis>Speed (Alt-S)</emphasis> - determines how quickly the mouse pointer will move when keyboard directional keys are pressed.
sv: <emphasis>Hastighet (Alt-H)</emphasis> - bestämmer hur snabbt muspekaren ska röra sig när tangentbordets riktningstangenter trycks ned.

source: <emphasis>Delay (Alt-D)</emphasis> - determines how much (or if) keypresses may be dampened or ignored when keyboard directional keys are pressed.
sv: <emphasis>Fördröjning (Alt-F)</emphasis> - bestämmer hur mycket (eller om) tangenttryckningar kan dämpas eller ignoreras när tangentbordets riktningstangenter trycks ned.

source: MouseTweaks
sv: Musjusteringar

source: <application>MouseTweaks</application> is a collection of accessibility enhancements for pointing devices. The <userinput>mousetweaks</userinput> package provides the functions offered by the <guilabel>Accessibility</guilabel> tab of the <guilabel>Mouse</guilabel> preference tool. It also contains two panel applets related to the mouse accessibility. More particularly:
sv: <application>Musjusteringar</application> är en samling hjälpmedelsförbättringar för pekdon. Paketet <userinput>mousetweaks</userinput> tillhandahåller funktionerna som erbjuds av fliken <guilabel>Hjälpmedel</guilabel> i inställningsverktyget <guilabel>Mus</guilabel>. Det innehåller även två panelprogram som är relaterade till mushjälpmedel. Mer specifikt:

source: It allows users to perform a secondary click by doing a click-and-hold of the primary mouse button.
sv: Det låter användare genomföra ett sekundärklick genom att klicka och hålla ner den primära musknappen.

source: Simulated Secondary Click
sv: Simulerat sekundärklick

source: A secondary or right-click can be issued by using the primary button and keeping it held down for a specified delay.
sv: Ett sekundär- eller högerklick kan genomföras genom att använda primärknappen och hålla ner den för en angiven tidsperiod.

source: Dwell Click
sv: Uppehållsklick

source: Pointer Capture
sv: Pekarfångst

source: Dasher is an information-efficient text-entry interface, driven by natural continuous pointing gestures. Dasher is a competitive text-entry system wherever a full-size keyboard cannot be used - for example on a palmtop or wearable computer, or when operating any computer one-handed (by joystick, touchscreen or mouse) or zero-handed (eg, by head-mouse or eye-tracker).
sv: Dasher är ett informationseffektivt textinmatningsgränssnitt som styrs av naturliga, kontinuerliga pekgester. Dasher är ett konkurrenskraftigt textinmatningssystem där ett tangentbord med full storlek inte kan användas - till exempel på en handdator eller en mindre dator, eller när en dator används med en hand (med styrspak, pekskärm eller mus) eller inga händer alls (t.ex. med huvudstyrd mus eller ögonspårare).

source: Choose <menuchoice><guimenuitem>Applications</guimenuitem><guimenuitem>Accessories</guimenuitem><guimenuitem>Terminal</guimenuitem></menuchoice>.
sv: Välj <menuchoice><guimenuitem>Program</guimenuitem><guimenuitem>Tillbehör</guimenuitem><guimenuitem>Terminal</guimenuitem></menuchoice>.

source: Enter: <userinput>sudo apt-get install dasher </userinput>
sv: Ange: <userinput>sudo apt-get install dasher </userinput>

source: Enter: <userinput>dasher</userinput>
sv: Ange: <userinput>dasher</userinput>

source: Dasher may also be installed from the <menuchoice><guimenuitem>Applications</guimenuitem><guimenuitem>Add/Remove</guimenuitem></menuchoice> dialog. In either case, it may later be launched in these ways:
sv: Dasher kan även installeras från dialogrutan <menuchoice><guimenuitem>Program</guimenuitem><guimenuitem>Lägg till/Ta bort</guimenuitem></menuchoice>. Oavsett kan den senare startas på följande sätt:

source: Press <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo> or <keycombo><keycap>Meta</keycap><keycap>R</keycap></keycombo> for the <emphasis>Run</emphasis> dialog, type <userinput>dasher</userinput> and press <keycap>Enter</keycap>.
sv: Tryck på <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo> eller <keycombo><keycap>Meta</keycap><keycap>R</keycap></keycombo> för dialogrutan <emphasis>Kör</emphasis>, ange <userinput>dasher</userinput> och tryck på <keycap>Enter</keycap>.

source: Choose <menuchoice><guimenuitem>Applications</guimenuitem><guimenuitem>Accessories</guimenuitem><guimenuitem>Terminal</guimenuitem></menuchoice> and execute <userinput>dasher</userinput>.
sv: Välj <menuchoice><guimenuitem>Program</guimenuitem><guimenuitem>Tillbehör</guimenuitem><guimenuitem>Terminal</guimenuitem></menuchoice> och kör <userinput>dasher</userinput>.

source: Press <keycap>Alt-F1</keycap> and select <menuchoice><guimenuitem>Applications</guimenuitem><guimenuitem>Universal Access</guimenuitem><guimenuitem>Dasher</guimenuitem></menuchoice>.
sv: Tryck på <keycap>Alt-F1</keycap> och välj <menuchoice><guimenuitem>Program</guimenuitem><guimenuitem>Allmän åtkomst</guimenuitem><guimenuitem>Dasher</guimenuitem></menuchoice>.

source: translator-credits
sv: Daniel Nylander <po@danielnylander.se>, 2006, 2007, 2008, 2009
