Repository: eurolinux-enterprise-linux-sources/gnome-user-docs
Catalog: src/gnome2-accessibility-guide/*/*.po
Languages: sv

source: <emphasis>Screen Magnifier</emphasis> - this is like a magnifying glass. People using them are able to control what area of the computer screen they want enlarged, and can move the magnifier to view different areas of the screen. They are also known as screen enlargers or large print programs.
sv: <emphasis>Skärmförstorare</emphasis> - detta liknar ett förstoringsglas. Personer som använder dem kan kontrollera vilken del av datorskärmen som de vill förstora och kan förflytta förstoringen för att visa olika delar av skärmen. De är även kända som skärmzoomning eller program för stor text.

source: <emphasis>Screen Reader</emphasis> - this makes on-screen information available as synthesized speech and/or a refreshable braille display. They generally only translate text-based information. Graphics and other non-textual objects can be translated if there is alternative text describing the item. They are also known as blind access utilities or screen reviewers.
sv: <emphasis>Skärmläsare</emphasis> - detta gör information på skärmen tillgänglig via en talsyntes och/eller en uppdateringsbar punktskriftsterminal. De översätter oftast bara textbaserad information. Grafik och andra icke-textbaserade objekt kan översättas om det finns en alternativ text som beskriver objektet. De är även kända som hjälpmedelsverktyg för blinda eller skärmgranskare.

source: Desktop Appearance Enhancement
sv: Förbättring av skrivbordsutseendet

source: This chapter describes the methods you can use to change the appearance of the GNOME Desktop in order to enhance the accessibility of the desktop for users with visual impairments.
sv: Detta kapitel beskriver metoderna som du kan använda för att ändra utseendet för GNOME-skrivbordet för att förbättra tillgängligheten i skrivbordet för användare med nedsatt syn.

source: Customization Options
sv: Anpassningsalternativ

source: customizing the desktop appearance
sv: anpassa skrivbordets utseende

source: There are several ways to customize the appearance of the GNOME Desktop to suit your specific needs:
sv: Det finns flera sätt att anpassa utseendet på GNOME-skrivbordet för att passa dina specifik behov:

source: Themes
sv: Teman

source: Themes are the most effective way to change the appearance of the desktop in a consistent manner. See <xref linkend="themes-2"/> for more information about themes and how to use them to achieve the type of desktop environment that you require.
sv: Teman är det mest effektiva sättet att ändra utseendet på skrivbordet på ett konsekvent sätt. Se <xref linkend="themes-2"/> för mer information om teman och hur man använder dem för att uppnå den typ av skrivbordsmiljö som du kräver.

source: Desktop and Application-Specific Configuration Settings
sv: Skrivbords- och programspecifika konfigurationsinställningar

source: You can customize different components of the desktop to achieve the display settings that you require. You can configure the desktop and applications in addition to using themes or as an alternative to themes. See <xref linkend="themes-7"/> for more information.
sv: Du kan anpassa olika komponenter av skrivbordet för att uppnå de visningsinställningar som du kräver. Du kan konfigurera skrivbordet och program i tillägg till att använda teman eller som ett alternativ till teman. Se <xref linkend="themes-7"/> för mer information.

source: The following table summarizes the changes that you can make to the GNOME Desktop and where you can make the changes. This guide does not provide detailed instructions about how to customize the desktop. For detailed instructions about how to use the customization tools that the desktop provides, refer to the Help for each tool or to the <ulink type="help" url="ghelp:user-guide?prefs">User Guide</ulink>.
sv: Följande tabell sammanfattar ändringarna som du kan göra med GNOME-skrivbordet och var du kan göra ändringarna. Denna guide tillhandahåller inte detaljerade instruktioner om hur man anpassar skrivbordet. För detaljerade instruktioner om hur man använder anpassningsverktygen som skrivbordet tillhandahåller så referera till hjälpen för varje verktyg eller till <ulink type="help" url="ghelp:user-guide?prefs">användarguiden</ulink>.

source: Quick Reference to Customizing the Appearance of the Desktop
sv: Snabbreferens för att anpassa utseendet för skrivbordet

source: To change the...
sv: För att ändra...

source: Use...
sv: Använd...

source: Overall appearance of the desktop using high-contrast colors, low-contrast colors, or large print.
sv: Övergripande utseende för skrivbordet med färger i hög kontrast, färger i låg kontrast eller stor text.

source: The <guilabel>Theme</guilabel> section of the <application>Appearance</application> preference tool.
sv: Sektionen <guilabel>Tema</guilabel> i inställningsverktyget <application>Utseende</application>.

source: Appearance of the desktop background only.
sv: Endast utseendet för skrivbordsbakgrunden.

source: The <guilabel>Desktop Background</guilabel> section of the <application>Appearance</application> preference tool; also the file manager <guilabel>Backgrounds and Emblems</guilabel> menu item.
sv: Sektionen <guilabel>Skrivbordsbakgrund</guilabel> i inställningsverktyget <application>Utseende</application>; även filhanterarens menyobjekt <guilabel>Bakgrunder och emblem</guilabel>.

source: Appearance of the mouse pointer.
sv: Utseende för muspekaren.

source: The <guilabel>Theme</guilabel> section of the <application>Appearance</application> preference tool; use the <guilabel>Pointers</guilabel> tab of the <guilabel>Customize</guilabel> option.
sv: Sektionen <guilabel>Tema</guilabel> i inställningsverktyget <application>Utseende</application>; använd fliken <guilabel>Muspekare</guilabel> i alternativet <guilabel>Anpassa</guilabel>.

source: Font displayed on the desktop background and in all desktop applications.
sv: Typsnitt visade på skrivbordsbakgrunden och i alla skrivbordsprogram.

source: The <guilabel>Font</guilabel> section of the <application>Appearance</application> preference tool.
sv: Sektionen <guilabel>Typsnitt</guilabel> i inställningsverktyget <application>Utseende</application>.

source: Default font settings of the <application>Text Editor</application>, <application>Terminal</application> or <application>Help</application> application.
sv: Inställningar för standardtypsnitt för programmen <application>Textredigerare</application>, <application>Terminal</application> eller <application>Hjälp</application>.

source: Normally these applications use the default application font that is specified in the <guilabel>Font</guilabel> section of the <application>Appearance</application> preference tool, but these font settings can also be overridden in the <guilabel>Preferences</guilabel> dialog for the application.
sv: Oftast använder dessa program standardtypsnittet för program som har angivits i sektionen <guilabel>Typsnitt</guilabel> i inställningsverktyget <application>Utseende</application>, men dessa typsnittsinställningar kan även åsidosättas i dialogrutan <guilabel>Inställningar</guilabel> för programmet.

source: Using Themes to Customize the Desktop
sv: Användning av teman för att anpassa skrivbordet

source: This section describes how to use themes to customize the appearance of the GNOME Desktop.
sv: Det här avsnittet beskriver hur man använder teman för att anpassa utseendet för GNOME-skrivbordet.

source: Introduction to Themes
sv: Introduktion till teman

source: themes
sv: teman

source: A theme is a group of coordinated settings that specifies how a desktop component or a group of desktop components appears. You can use themes to modify and control the appearance of the desktop in a consistent manner. When you apply a theme, the system modifies many desktop components simultaneously to achieve the desired effect. For example, if you apply a theme that increases the font size across the desktop, the theme also modifies the size of panels and icons on the desktop for optimum compatibility with the font size. Some themes have suggested font settings that may optionally be auto-set; in addition, most colors within a theme can be customized.
sv: Ett teman är en grupp av koordinerade inställningar som anger hur en skrivbordskomponent eller en grupp av skrivbordskomponenter visas. Du kan använda teman för att ändra och kontrollera utseendet för skrivbordet på ett konsekvent sätt. När du tillämpar ett tema så ändrar systemet många skrivbordskomponenter samtidigt för att uppnå den önskade effekten. Till exempel om du tillämpar ett tema som ökar typsnittsstorleken för hela skrivbordet så ändrar temat även storleken på paneler och ikoner på skrivbordet för optimal kompatibilitet med typsnittsstorleken. Vissa teman har föreslagna typsnittsinställningar som valfritt och automatiskt ställas in; i tillägg kan de flesta färger inom ett tema anpassas.

source: A theme contains settings that affect different parts of the desktop:
sv: Ett tema innehåller inställningar som påverkar olika delar av skrivbordet:

source: The controls setting for a theme determines the visual appearance of all windows, applications, panels, and panel applications. The controls setting also determines the visual appearance of the GNOME-compliant interface items that appear on windows, applications, panels, and panel applications such as menus, icons, and buttons. Some of the control options that are available in the desktop are designed for special accessibility needs.
sv: Kontrollerinställningen för ett tema bestämmer det visuella utseendet för alla fönster, program, paneler och panelprogram. Kontrollerinställningen bestämmer även det visuella utseendet för GNOME-standardiserade gränssnittsobjekt som visas på fönster, program, paneler och panelprogram såsom menyer, ikoner och knappar. Några av kontrolleralternativen som finns tillgängliga i skrivbordet är designade för hjälpmedelsbehov.

source: Window Border
sv: Fönsterram

source: The window frame setting determines the appearance of the border around windows only.
sv: Inställningen för fönsterram bestämmer endast utseendet för ramen runt fönster.

source: Icon
sv: Ikon

source: The icon setting determines the appearance of icons on panels and on the desktop background.
sv: Ikoninställningen bestämmer utseendet för ikoner på paneler och på skrivbordsbakgrunden.

source: Choosing Themes
sv: Välj teman

source: desktop
sv: skrivbord

source: To choose a theme, perform the following steps:
sv: Genomför följande steg för att välja ett tema:

source: Choose <menuchoice><guimenu>System</guimenu><guisubmenu>Preferences</guisubmenu><guimenuitem>Appearance </guimenuitem></menuchoice>. The themes are listed under the <guilabel>Theme</guilabel> tab.
sv: Välj <menuchoice><guimenu>System</guimenu><guisubmenu>Inställningar</guisubmenu><guimenuitem>Utseende </guimenuitem></menuchoice>. Teman listas under fliken <guilabel>Tema</guilabel>.

source: Click on a theme in the list box to choose a new theme. The system automatically applies the theme to the desktop, and may also prompt whether to apply a suggested font for the theme.
sv: Klicka på ett tema i listrutan för att välja ett nytt tema. Systemet tillämpar automatiskt temat till skrivbordet och kan även fråga huruvida det ska tillämpa ett föreslaget typsnitt för temat.

source: There are several themes available that suit different accessibility needs, as described in the following table:
sv: Det finns flera teman tillgängliga som passar olika hjälpmedelsbehov, vilket beskrivs i följande tabell:

source: Themes Designed for Accessibility Requirements
sv: Teman designade för hjälpmedelskrav

source: Theme Name
sv: Temanamn

source: High Contrast
sv: Hög kontrast

source: Provides dark text on a light background using high-contrast colors.
sv: Tillhandahåller mörk text på en ljus bakgrund med färger i hög kontrast.

source: High Contrast Inverse
sv: Inverterad hög kontrast

source: Provides light text on a dark background using high-contrast colors.
sv: Tillhandahåller ljus text på en mörk bakgrund med färger i hög kontrast.

source: Large Print
sv: Stor text

source: This theme suggests an increased font size of 18pt. The background and foreground colors are the same as those specified by the <guilabel>Default</guilabel> desktop theme. To apply the suggested font, click on the <guibutton>Apply Font</guibutton> button.
sv: Detta tema föreslår en ökad typsnittsstorlek på 18 punkter. Bakgrunds- och förgrundsfärgerna är samma som de som angivits av skrivbordstemat <guilabel>Standard</guilabel>. Klicka på knappen <guibutton>Tillämpa typsnitt</guibutton> för att tillämpa det föreslagna typsnittet.

source: High Contrast Large Print
sv: Stor text med hög kontrast

source: This theme suggests an increased font size of 18pt using dark text on a light background. To apply the suggested font, click on the <guibutton>Apply Font</guibutton> button.
sv: Detta tema föreslår en ökad typsnittsstorlek på 18 punkter med en mörk text på en ljus bakgrund. Klicka på knappen <guibutton>Tillämpa typsnitt</guibutton> för att tillämpa det föreslagna typsnittet.

source: High Contrast Large Print Inverse
sv: Inverterad stor text med hög kontrast

source: This theme suggests an increased font size of 18pt using light text on a dark background. To apply the suggested font, click on the <guibutton>Apply Font</guibutton> button.
sv: Detta tema föreslår en ökad typsnittsstorlek på 18 punkter med en ljus text på en mörk bakgrund. Klicka på knappen <guibutton>Tillämpa typsnitt</guibutton> för att tillämpa det föreslagna typsnittet.

source: In some GNOME distributions there are also prebuilt low-contrast/low-contrast-large-print themes to complement the high-contrast theme set.
sv: I vissa GNOME-distributioner så finns det även förbyggda teman med låg kontrast/låg kontrast med stor text som ett komplement till de teman med hög kontrast.

source: To view the controls, window frame, and icon settings that are associated with a theme, select a theme in the <guilabel>Appearance </guilabel> preference tool, then click on the <guibutton>Theme</guibutton> tab. The <guilabel>Customize</guilabel> option contains a tabbed section for each setting category. Each tabbed section lists the options that are available and the current setting for the theme is highlighted.
sv: För att visa kontrollerna, fönsterram och ikoninställningar som är associerade med ett tema, markera ett tema i inställningsverktyget <guilabel>Utseende </guilabel>, klicka sedan på fliken <guibutton>Tema</guibutton>. Alternativet <guilabel>Anpassa</guilabel> innehåller en flikad sektion för varje inställningskategori. Varje flikade sektion listar alternativen som finns tillgängliga och den aktuella inställningen för temat är markerat.

source: Modifying the Controls Setting for a Theme
sv: Ändra kontrollerinställningen för ett tema

source: To modify the controls setting that is associated with a theme, perform the following steps:
sv: Genomför följande steg för att ändra kontrollerinställningen som är associerad med ett tema:

source: Within the <guilabel>Theme</guilabel> tab, select the theme that you want to modify.
sv: Markera temat som du vill ändra i fliken <guilabel>Tema</guilabel>.

source: Click on the <guibutton>Customize</guibutton> button. The <guilabel>Customize Theme</guilabel> dialog is displayed.
sv: Klicka på knappen <guibutton>Anpassa</guibutton>. Dialogrutan <guilabel>Anpassa tema</guilabel> kommer att visas.

source: Click on the <guilabel>Controls</guilabel> tab to display the controls options that are available.
sv: Klicka på fliken <guilabel>Kontroller</guilabel> för att visa kontrolleralternativen som finns tillgängliga.

source: Select the controls option that you want to associate with the current theme from the list box, then click <guibutton>Close</guibutton>. The following table lists the controls options that are suitable for accessibility needs:
sv: Välj det kontrollalternativ som du vill associera med det aktuella temat från listrutan, klicka sedan på <guibutton>Stäng</guibutton>. Följande tabell listar kontrollalternativen som är lämpliga för hjälpmedelsbehov:

source: Controls Options Designed for Accessibility Requirements
sv: Kontrollalternativ designade för hjälpmedelskrav

source: Control Option
sv: Kontrollalternativ

source: Increases the size of controls to accommodate larger fonts. To increase the font size, you must use the <application>Font</application> preference tool. The background and foreground colors are the same as those specified by the <guilabel>Default</guilabel> desktop theme.
sv: Ökar storleken för kontrollerna för att passa större typsnitt. För att öka typsnittsstorleken så måste du använda inställningsverktyget <application>Typsnitt</application>. Bakgrund- och förgrundsfärgerna är de samma som de som angivits av skrivbordstemat <guilabel>Standard</guilabel>.

source: Provides dark text on a light background using high-contrast colors. Increases the size of controls to accommodate larger fonts. To increase the font size, you must use the <application>Font</application> preference tool.
sv: Tillhandahåller mörk text på en ljus bakgrund med färger i hög kontrast. Ökar storleken på kontrollerna för att passa större typsnitt. För att öka typsnittsstorleken så måste du använda inställningsverktyget <application>Typsnitt</application>.

source: Provides light text on a dark background using high-contrast colors. Increases the size of controls to accommodate larger fonts. To increase the font size, you must use the <application>Font</application> preference tool.
sv: Tillhandahåller ljus text på en mörk bakgrund med färger i hög kontrast. Ökar storleken på kontrollerna för att passa större typsnitt. För att öka typsnittsstorleken så måste du använda inställningsverktyget <application>Typsnitt</application>.

source: Modifying the Window Border Setting for a Theme
sv: Ändra fönsterramsinställningen för ett tema

source: window border
sv: fönsterram

source: To modify the window border setting that is associated with a theme, perform the following steps:
sv: Genomför följande steg för att ändra fönsterramsinställningen som är associerad med ett tema:

source: In the <application>Appearance</application> preference tool, choose the <guilabel>Theme</guilabel> tab and the theme you want to modify.
sv: Välj fliken <guilabel>Tema</guilabel> i inställningsverktyget <application>Utseende</application> och sedan det tema som du vill ändra.

source: Click on the <guilabel>Window Border</guilabel> tab to display the window frame options that are available.
sv: Klicka på fliken <guilabel>Fönsterram</guilabel> för att visa alternativen för fönsterramar som finns tillgängliga.

source: Select the window frame option that you want to associate with the current theme from the list box, then click <guibutton>Close</guibutton>. The <guilabel>Atlanta</guilabel> option is designed for accessibility.
sv: Välj det alternativ för fönsterram som du vill associera med det aktuella temat från listrutan, klicka sedan på <guibutton>Stäng</guibutton>. Alternativet <guilabel>Atlanta</guilabel> är designat för hjälpmedelsbehov.

source: Modifying the Icon Setting for a Theme
sv: Ändra ikoninställningen för ett tema

source: icon
sv: ikon

source: To modify the icon setting that is associated with a theme, perform the following steps:
sv: Genomför följande steg för att ändra ikoninställningen som är associerad med ett tema:

source: In the <application>Appearance</application> preference tool, choose the <guilabel>Theme</guilabel> tab and select the theme that you want to modify.
sv: Välj fliken <guilabel>Tema</guilabel> i inställningsverktyget <application>Utseende</application> och markera det tema som du vill ändra.

source: Click on the <guilabel>Icons</guilabel> tab to display the icon options that are available.
sv: Klicka på fliken <guilabel>Ikoner</guilabel> för att visa ikonalternativen som finns tillgängliga.

source: Select the icon option that you want to associate with the theme from the list box, then click <guibutton>Close</guibutton>. The following table lists the icon options that are suitable for accessibility needs:
sv: Välj det ikonalternativ som du vill associera med temat från listrutan, klicka sedan på <guibutton>Stäng</guibutton>. Följande tabell listar ikonalternativen som är lämpliga för hjälpmedelsbehov:

source: Icon Options Designed for Accessibility Requirements
sv: Ikonalternativ designade för hjälpmedelskrav

source: Icon Option
sv: Ikonalternativ

source: Provides dark-on-light icons using high-contrast colors.
sv: Tillhandahåller mörkt-på-ljust-ikoner med färger i hög kontrast.

source: Provides light-on-dark icons using high-contrast colors.
sv: Tillhandahåller ljust-på-mörkt-ikoner med färger i hög kontrast.

source: Creating Your Own Themes
sv: Skapa dina egna teman

source: creating own
sv: skapa egna

source: For information about how to create your own themes, see the <ulink type="help" url="ghelp:system-admin-guide?themes-0"> System Administration Guide</ulink>.
sv: För information om hur man skapar sina egna teman, se <ulink type="help" url="ghelp:system-admin-guide?themes-0"> Systemadministrationsguiden</ulink>.

source: Customizing Specific Components of the Desktop
sv: Anpassning av specifika komponenter på skrivbordet

source: This section describes how to customize specific components of the GNOME Desktop individually.
sv: Det här avsnittet beskriver hur man individuellt anpassar specifika komponenter för GNOME-skrivbordet.

source: Customizing the Desktop Background
sv: Anpassa skrivbordsbakgrunden

source: customizing desktop appearance
sv: anpassa skrivbordets utseende

source: desktop background
sv: skrivbordsbakgrund

source: The themes do not affect the desktop background. To set the desktop background, choose <menuchoice><guimenu>System</guimenu><guisubmenu>Preferences</guisubmenu><guimenuitem>Appearance</guimenuitem></menuchoice> and select a background from the <guilabel>Background</guilabel> tab. If no background is chosen, the first entry listed here may be used.
sv: Teman påverkar inte skrivbordsbakgrunden. För att ställa in skrivbordsbakgrunden, välj <menuchoice><guimenu>System</guimenu><guisubmenu>Inställningar</guisubmenu><guimenuitem>Utseende</guimenuitem></menuchoice> och välj en bakgrund från fliken <guilabel>Bakgrund</guilabel>. Om ingen bakgrund väljs så kan det första objektet som listas användas.

source: Customizing Desktop Background Objects
sv: Anpassa skrivbordsbakgrundsobjekt

source: desktop background objects
sv: skrivbordsbakgrundsobjekt

source: The size of the icons that are displayed on the desktop background is controlled by the <application>File Management</application> preference tool. To change the size of the icons, perform the following steps:
sv: Storleken för ikonerna som visas på skrivbordsbakgrunden kontrolleras av inställningsverktyget i <application>filhanteraren</application>. Genomför följande steg för att ändra storleken för ikonerna:

source: From the <application>File Manager</application> window, choose the <menuchoice><guimenu>Edit</guimenu><guisubmenu>Preferences</guisubmenu></menuchoice> menu item.
sv: Välj menyobjektet <menuchoice><guimenu>Redigera</guimenu><guisubmenu>Inställningar</guisubmenu></menuchoice> från <application>filhanterarens</application> fönster.

source: Select the <guilabel>Views</guilabel> tabbed section.
sv: Välj fliksektionen <guilabel>Vyer</guilabel>.

source: In the <guilabel>Icon View Defaults</guilabel> group, select the zoom level that you require in the <guilabel>Default Zoom Level</guilabel> drop-down list.
sv: I gruppen <guilabel>Standardalternativ för ikonvyn</guilabel>, välj den zoomnivå i rullgardinslistan <guilabel>Standardzoomnivå</guilabel> som du vill ha.

source: Customizing Fonts
sv: Anpassa typsnitt
