Repository: eurolinux-enterprise-linux-sources/gnome-user-docs
Catalog: src/gnome2-accessibility-guide/*/*.po
Languages: sv

source: GNOME Desktop Accessibility Guide
sv: Hjälpmedelsguide för GNOME-skrivbordet

source: The GNOME Accessibility Guide is for users, system administrators, and anyone else who is interested in how the GNOME Desktop supports people with disabilities. This guide also addresses the requirements of Section 508 of the U.S. Rehabilitation Act.
sv: Hjälpmedelsguiden för GNOME är till för användare, systemadministratörer och alla som är intresserade i hur GNOME-skrivbordet ger stöd till personer med handikapp. Denna guide inkluderar även kraven för paragraf 508 av U.S. Rehabilitation Act.

source: GNOME Documentation Project
sv: Dokumentationsprojekt för GNOME

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License (GFDL), Version 1.1 or any later version published by the Free Software Foundation with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. You can find a copy of the GFDL <ulink type="help" url="ghelp:fdl"> here</ulink> or in the file COPYING-DOCS distributed with this manual.
sv: Tillstånd att kopiera, distribuera och/eller modifiera detta dokument ges under villkoren i GNU Free Documentation License (GFDL), version 1.1 eller senare, utgivet av Free Software Foundation utan standardavsnitt och omslagstexter. En kopia av GFDL finns att hämta <ulink type="help" url="ghelp:fdl">här</ulink> eller i filen COPYING-DOCS som medföljer denna handbok.

source: This manual is part of a collection of GNOME manuals distributed under the GFDL. If you want to distribute this manual separately from the collection, you can do so by adding a copy of the license to the manual, as described in Section 6 of the license.
sv: Denna handbok utgör en av flera GNOME-handböcker som distribueras under villkoren i GFDL. Om du vill distribuera denna handbok separat från övriga handböcker kan du göra detta genom att lägga till en kopia av licensavtalet i handboken enligt instruktionerna i paragraf 6 i licensavtalet.

source: Many of the names used by companies to distinguish their products and services are claimed as trademarks. Where those names appear in any GNOME documentation, and the members of the GNOME Documentation Project are made aware of those trademarks, then the names are in capital letters or initial capital letters.
sv: Flera namn på produkter och tjänster är registrerade varumärken. I de fall dessa namn förekommer i GNOME-dokumentation - och medlemmarna i GNOME-dokumentationsprojektet är medvetna om dessa varumärken - är de skrivna med versaler eller med inledande versal.

source: DOCUMENT IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS FREE OF DEFECTS MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY, ACCURACY, AND PERFORMANCE OF THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS WITH YOU. SHOULD ANY DOCUMENT OR MODIFIED VERSION PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL WRITER, AUTHOR OR ANY CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER; AND
sv: DOKUMENTET TILLHANDAHÅLLS I "BEFINTLIGT SKICK" UTAN NÅGRA SOM HELST GARANTIER, VARE SIG UTTRYCKLIGA ELLER UNDERFÖRSTÅDDA, INKLUSIVE, MEN INTE BEGRÄNSAT TILL, GARANTIER ATT DOKUMENTET ELLER EN MODIFIERAD VERSION AV DOKUMENTET INTE INNEHÅLLER NÅGRA FELAKTIGHETER, ÄR LÄMPLIGT FÖR ETT VISST ÄNDAMÅL ELLER INTE STRIDER MOT LAG. HELA RISKEN VAD GÄLLER KVALITET, EXAKTHET OCH UTFÖRANDE AV DOKUMENTET OCH MODIFIERADE VERSIONER AV DOKUMENTET LIGGER HELT OCH HÅLLET PÅ ANVÄNDAREN. OM ETT DOKUMENT ELLER EN MODIFIERAD VERSION AV ETT DOKUMENT SKULLE VISA SIG INNEHÅLLA FELAKTIGHETER I NÅGOT HÄNSEENDE ÄR DET DU (INTE DEN URSPRUNGLIGA SKRIBENTEN, FÖRFATTAREN ELLER NÅGON ANNAN MEDARBETARE) SOM FÅR STÅ FÖR ALLA EVENTUELLA KOSTNADER FÖR SERVICE, REPARATIONER ELLER KORRIGERINGAR. DENNA GARANTIFRISKRIVNING UTGÖR EN VÄSENTLIG DEL AV DETTA LICENSAVTAL. DETTA INNEBÄR ATT ALL ANVÄNDNING AV ETT DOKUMENT ELLER EN MODIFIERAD VERSION AV ETT DOKUMENT BEVILJAS ENDAST UNDER DENNA ANSVARSFRISKRIVNING;

source: UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER IN TORT (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE AUTHOR, INITIAL WRITER, ANY CONTRIBUTOR, OR ANY DISTRIBUTOR OF THE DOCUMENT OR MODIFIED VERSION OF THE DOCUMENT, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO ANY PERSON FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER DAMAGES OR LOSSES ARISING OUT OF OR RELATING TO USE OF THE DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES.
sv: UNDER INGA OMSTÄNDIGHETER ELLER INOM RAMEN FÖR NÅGON LAGSTIFTNING, OAVSETT OM DET GÄLLER KRÄNKNING (INKLUSIVE VÅRDSLÖSHET), KONTRAKT ELLER DYLIKT, SKA FÖRFATTAREN, DEN URSPRUNGLIGA SKRIBENTEN ELLER ANNAN MEDARBETARE ELLER ÅTERFÖRSÄLJARE AV DOKUMENTET ELLER AV EN MODIFIERAD VERSION AV DOKUMENTET ELLER NÅGON LEVERANTÖR TILL NÅGON AV NÄMNDA PARTER STÄLLAS ANSVARIG GENTEMOT NÅGON FÖR NÅGRA DIREKTA, INDIREKTA, SÄRSKILDA ELLER OFÖRUTSEDDA SKADOR ELLER FÖLJDSKADOR AV NÅGOT SLAG, INKLUSIVE, MEN INTE BEGRÄNSAT TILL, SKADOR BETRÄFFANDE FÖRLORAD GOODWILL, HINDER I ARBETET, DATORHAVERI ELLER NÅGRA ANDRA TÄNKBARA SKADOR ELLER FÖRLUSTER SOM KAN UPPKOMMA PÅ GRUND AV ELLER RELATERAT TILL ANVÄNDNINGEN AV DOKUMENTET ELLER MODIFIERADE VERSIONER AV DOKUMENTET, ÄVEN OM PART SKA HA BLIVIT INFORMERAD OM MÖJLIGHETEN TILL SÅDANA SKADOR.

source: DOCUMENT AND MODIFIED VERSIONS OF THE DOCUMENT ARE PROVIDED UNDER THE TERMS OF THE GNU FREE DOCUMENTATION LICENSE WITH THE FURTHER UNDERSTANDING THAT: <placeholder-1/>
sv: DOKUMENTET OCH MODIFIERADE VERSIONER AV DOKUMENTET TILLHANDAHÅLLS UNDER VILLKOREN I GNU FREE DOCUMENTATION LICENSE ENDAST UNDER FÖLJANDE FÖRUTSÄTTNINGAR: <placeholder-1/>

source: GNOME 2.24 Desktop Accessibility Guide V2.24.0
sv: Hjälpmedelsguide för GNOME-skrivbordet 2.24 v2.24.0

source: GNOME 2.10 Desktop Accessibility Guide V2.10.1
sv: Hjälpmedelsguide för GNOME-skrivbordet 2.10 v2.10.1

source: July 2005
sv: Juli 2005

source: GNOME 2.10 Desktop Accessibility Guide V2.10.0
sv: Hjälpmedelsguide för GNOME-skrivbordet 2.10 v2.10.0

source: March 2005
sv: Mars 2005

source: GNOME 2.8 Desktop Accessibility Guide V2.8.0
sv: Hjälpmedelsguide för GNOME-skrivbordet 2.8 v2.8.0

source: GNOME 2.6 Desktop Accessibility Guide V2.6.0
sv: Hjälpmedelsguide för GNOME-skrivbordet 2.6 v2.6.0

source: March 2004
sv: Mars 2004

source: GNOME 2.4 Desktop Accessibility Guide V2.4.0
sv: Hjälpmedelsguide för GNOME-skrivbordet 2.4 v2.4.0

source: October 2003
sv: Oktober 2003

source: GNOME 2.2 Desktop Accessibility Guide V2.2.0
sv: Hjälpmedelsguide för GNOME-skrivbordet 2.2 v2.2.0

source: February 2003
sv: Februari 2003

source: GNOME 2.0 Desktop for the Solaris Operating Environment Accessibility Guide V2.1
sv: Hjälpmedelsguide för GNOME-skrivbordet för operativsystemsmiljön Solaris v2.1

source: January 2003
sv: Januari 2003

source: GNOME 2.0 Desktop for the Solaris Operating Environment Accessibility Guide V2.0
sv: Hjälpmedelsguide för GNOME-skrivbordet för operativsystemsmiljön Solaris v2.0

source: This manual describes version 2.24 of the GNOME Desktop.
sv: Denna handbok beskriver version 2.24 av GNOME-skrivbordet.

source: Feedback
sv: Återkoppling

source: To report a bug or make a suggestion regarding the GNOME Desktop or this manual, follow the directions in the <ulink type="help" url="ghelp:user-guide?feedback">GNOME Feedback Page</ulink>.
sv: För att rapportera ett fel eller komma med ett förslag angående GNOME-skrivbordet eller denna handbok, följ instruktionerna på <ulink type="help" url="ghelp:user-guide?feedback">GNOME:s återkopplingssida</ulink>.

source: Introduction to Accessibility
sv: Introduktion till hjälpmedelsfunktioner

source: Section 508
sv: Sektion 508

source: This chapter introduces you to accessibility in the GNOME Desktop.
sv: Det här kapitlet introducerar dig till hjälpmedelsfunktionerna i GNOME-skrivbordet.

source: All software products should incorporate accessibility features to enable people with disabilities to use the software easily and efficiently. Recent legislation such as Section 508 of the U.S. Rehabilitation Act heightens awareness of the need to provide accessible software.
sv: All programvara ska innefatta hjälpmedelsfunktioner för att låta personer med handikapp använda programvaran på ett enkelt och effektivt sätt. Tidigare lagstiftning såsom Sektion 508 av U.S. Rehabilitation Act ökar medvetenheten om behovet av att tillhandahålla programvara med hjälpmedelsfunktionalitet.

source: The GNOME Desktop is easy to use and incorporates many accessibility features. Every supported application and utility in the GNOME Desktop is designed with accessibility and usability in mind. Users with physical disabilities such as low vision or impaired motor skills can use all of the functionality of the GNOME Desktop thanks to the customization tools that are available. These customization tools enable you to fine-tune the appearance and behavior of the desktop.
sv: GNOME-skrivbordet är enkelt att använda och innehåller många hjälpmedelsfunktioner. Varje program och verktyg som stöds i GNOME-skrivbordet är designat med tanke på hjälpmedel och användbarhet. Användare med funktionshinder såsom nedsatt syn eller nedsatt motorik kan använda all funktionalitet i GNOME-skrivbordet tack vare anpassningsverktygen som finns tillgängliga. Dessa anpassningsverktyg låter dig finjustera utseendet och beteendet för skrivbordet.

source: The ability to easily customize the GNOME Desktop contributes greatly to the accessibility of the desktop. This guide describes the various options available to meet your particular needs.
sv: Möjligheten att enkelt anpassa GNOME-skrivbordet bidrar stort till hjälpmedelsfunktionerna för skrivbordet. Den här guiden beskriver de olika anpassningsalternativen som du kan använda för att anpassa det till dina specifika behov.

source: Quick Reference
sv: Snabbreferens

source: To jump to a specific topic, follow these quick reference links:
sv: Följ dessa snabbreferenslänkar för att hoppa till ett specifikt ämne:

source: To hear screen elements spoken to you, see the <link linkend="enable-orca">Orca</link> section.
sv: Se avsnittet <link linkend="enable-orca">Orca</link> för att få skärmelement upplästa för dig.

source: If you need large print, read about <link linkend="themes-4">Choosing Themes</link> and <link linkend="themes-10">Customizing Fonts</link>.
sv: Läs om <link linkend="themes-4">Välj teman</link> och <link linkend="themes-10">Anpassa typsnitt</link> om du behöver större text.

source: To have some or all of the screen magnified, see the <link linkend="ats-2">Magnifier</link> section.
sv: Se avsnittet <link linkend="ats-2">Förstorare</link> för information om hur man får delar av eller hela skärmen förstorad.

source: If you prefer a pointing device over the keyboard, you can configure an on-screen keyboard for point-and-click typing; see the <link linkend="gok">GNOME Onscreen Keyboard (gok)</link> section.
sv: Se avsnittet <link linkend="gok">GNOME-skärmtangentbord (gok)</link> om du föredrar ett pekdon istället för tangentbordet så kan du konfigurera ett skärmtangentbord för att peka och klicka.

source: If you can only press one key at a time, see the Sticky Keys portion of the <link linkend="dtconfig-14">Configuring an Accessible Keyboard</link> section.
sv: Se delen om Klistriga tangenter i avsnittet <link linkend="dtconfig-14">Konfigurera ett hjälpmedelstangentbord</link> om du endast kan trycka ner en tangent åt gången.

source: If you tend to press keys for too long a time (normally causing inadvertant extra keys), see the Slow Keys portion of the <link linkend="dtconfig-14">Configuring an Accessible Keyboard</link> section.
sv: Se delen om Tröga tangenter i avsnittet <link linkend="dtconfig-14">Konfigurera ett hjälpmedelstangentbord</link> om du planerar att trycka ner tangenter under en längre tid (vilket normalt sett ger flera inmatade tecken).

source: If you tend to press keys multiple times (normally causing inadvertant extra keys), see the Bounce Keys portion of the <link linkend="dtconfig-14">Configuring an Accessible Keyboard</link> section.
sv: Se delen om Studsande tangenter i avsnittet <link linkend="dtconfig-14">Konfigurera ett hjälpmedelstangentbord</link> om du planerar att trycka ner tangenter flera gånger (vilket normalt sett ger flera inmatade tecken).

source: For further mouse- or pointer-based accessibility support, see the <link linkend="mousetweaks">MouseTweaks</link> and <link linkend="dtconfig-14">Configuring an Accessible Keyboard</link> sections. These tools supply several accessibility aids for pointer devices and keyboards.
sv: Se avsnitten <link linkend="mousetweaks">Musjusteringar</link> och <link linkend="dtconfig-14">Konfigurera ett hjälpmedelstangentbord</link> för ytterligare stöd för mus- eller pekdonsbaserade hjälpmedelsfunktioner. Dessa verktyg ger ett flertal hjälpmedelsfunktioner för pekdon och tangentbord.

source: General Accessibility Tips
sv: Allmänna hjälpmedelstips

source: A number of technologies can be of assistance to people with different types of disabilities. These are covered in this section. In particular:
sv: Ett antal tekniker kan vara behjälpliga för personer med olika typer av funktionshinder. Dessa täcks in i detta avsnitt. Speciellt dessa:

source: <emphasis> Essential Keyboard Commands </emphasis> - covers some basic keyboard commands.
sv: <emphasis> Grundläggande tangentbordskommandon </emphasis> - täcker in grundläggande tangentbordskommandon.

source: <emphasis> Keyboard Desktop Navigation </emphasis> - allows users to navigate the desktop without using a mouse or pointer device.
sv: <emphasis> Tangentbordsnavigering</emphasis> - låter användare navigera på skrivbordet utan en mus eller pekdon.

source: <emphasis> Accessible Login </emphasis> - users can configure the login screen to be more accessible.
sv: <emphasis> Hjälpmedelsinloggning</emphasis> - användare kan konfigurera inloggningskärmen till att vara mer tillgänglig.

source: Essential Keyboard Commands
sv: Grundläggande tangentbordskommandon

source: Before moving forward, be sure you are familiar with these essential GNOME commands:
sv: Innan du fortsätter bör du känna till följande grundläggande GNOME-kommandon:

source: <keycombo><keycap>Alt</keycap><keycap>F1</keycap></keycombo> [Debian] - display and activate the GNOME Desktop menu bar. This grants access to the <guimenu>Applications</guimenu>, <guimenu>Places</guimenu> and <guimenu>System</guimenu> menu bar items.
sv: <keycombo><keycap>Alt</keycap><keycap>F1</keycap></keycombo> [Debian] - visa och aktivera GNOME-skrivbordets menyrad. Detta tillåter åtkomst till menyradsobjekten <guimenu>Program</guimenu>, <guimenu>Platser</guimenu> och <guimenu>System</guimenu>.

source: For Solaris and Windows systems, this key is <keycombo><keycap>Ctrl</keycap><keycap>Esc</keycap></keycombo>.
sv: För Solaris och Windows-system är denna tangent <keycombo><keycap>Ctrl</keycap><keycap>Esc</keycap></keycombo>.

source: <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo> or <keycombo><keycap>Meta</keycap><keycap>R</keycap></keycombo> - summons the <application>Run</application> dialog, where you can issue terminal commands with or without parameters. If a file needs to be passed as one of these parameters, use the <guilabel>Run With File</guilabel> button to easily locate the file needed. This dialog also presents an alternate list of known applications which may be easier to navigate than the Debian system desktop menu (<keycombo><keycap>Alt</keycap><keycap>F1</keycap></keycombo>) approach.
sv: <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo> eller <keycombo><keycap>Meta</keycap><keycap>R</keycap></keycombo> - anropar dialogrutan <application>Kör</application> där du kan ange terminalkommandon med eller utan parametrar. Om en fil behöver skickas som en av dessa parametrar så använd knappen <guilabel>Kör med fil</guilabel> för att hitta filen som behövs. Denna dialogruta presenterar även en alternativlista över kända program som kan vara enklare att navigera än Debian-systemet skrivbordsmeny (alltså <keycombo><keycap>Alt</keycap><keycap>F1</keycap></keycombo>).

source: For Solaris systems, this key is <keycombo><keycap>Meta</keycap><keycap>R</keycap></keycombo> (as with Microsoft Windows). A meta- or super-key is an OS-logo shift key.
sv: För Solaris-system är denna tangent <keycombo><keycap>Meta</keycap><keycap>R</keycap></keycombo> (som med Microsoft Windows). En meta- eller super-tangent är en skifttangent med en operativsystemslogotyp på.

source: <keycap>Tab</keycap> and <keycombo><keycap>Shift</keycap><keycap>Tab</keycap></keycombo> - move focus within an application between controls; use <keycap>Tab</keycap> to cycle forward through controls and <keycombo><keycap>Shift</keycap><keycap>Tab</keycap></keycombo> to cycle backwards. Controls are any user-interactive element that you can manipulate, such as buttons, drop-down lists, text fields, etc. <keycombo><keycap>Ctrl</keycap><keycap>Tab</keycap></keycombo> and <keycombo><keycap>Shift</keycap><keycap>Ctrl</keycap><keycap>Tab</keycap></keycombo> are used instead where <keycap>Tab</keycap> and <keycombo><keycap>Shift</keycap><keycap>Tab</keycap></keycombo> are reserved for use by the focused control.
sv: <keycap>Tabulator</keycap> och <keycombo><keycap>Skift</keycap><keycap>Tabulator</keycap></keycombo> - flytta fokus inom ett program mellan kontroller; använd <keycap>Tabulator</keycap> för att växla framåt genom kontrollerna och <keycombo><keycap>Skift</keycap><keycap>Tabulator</keycap></keycombo> för att växla bakåt. Kontroller är alla användarinteraktiva element som du kan manipulera, såsom knappar, rullgardinslistor, textfält etc. <keycombo><keycap>Ctrl</keycap><keycap>Tabulator</keycap></keycombo> och <keycombo><keycap>Skift</keycap><keycap>Ctrl</keycap><keycap>Tabulator</keycap></keycombo> används istället där <keycap>Tabulator</keycap> och <keycombo><keycap>Skift</keycap><keycap>Tabulator</keycap></keycombo> är reserverade för användning av den fokuserade kontrollen.

source: <keycombo><keycap>Alt</keycap><keycap>Tab</keycap></keycombo> and <keycombo><keycap>Shift</keycap><keycap>Alt</keycap><keycap>Tab</keycap></keycombo> - switches between currently running applications. If you have multiple programs running, use <keycombo><keycap>Alt</keycap><keycap>Tab</keycap></keycombo> to cycle forward through the applications and <keycombo><keycap>Shift</keycap><keycap>Alt</keycap><keycap>Tab</keycap></keycombo> to cycle backwards. <keycombo><keycap>Alt</keycap><keycap>Esc</keycap></keycombo> and <keycombo><keycap>Shift</keycap><keycap>Alt</keycap><keycap>Esc</keycap></keycombo> also cycle between applications, but without an application preview window.
sv: <keycombo><keycap>Alt</keycap><keycap>Tabulator</keycap></keycombo> och <keycombo><keycap>Skift</keycap><keycap>Alt</keycap><keycap>Tabulator</keycap></keycombo> - växlar mellan för närvarande körande program. Om du har flera program igång så använd <keycombo><keycap>Alt</keycap><keycap>Tabulator</keycap></keycombo> för att växla framåt genom alla program och <keycombo><keycap>Skift</keycap><keycap>Alt</keycap><keycap>Tabulator</keycap></keycombo> för att växla bakåt. <keycombo><keycap>Alt</keycap><keycap>Esc</keycap></keycombo> och <keycombo><keycap>Skift</keycap><keycap>Alt</keycap><keycap>Esc</keycap></keycombo> växlar även mellan program men utan något förhandsvisningsfönster.

source: Accessible Login
sv: Hjälpmedelsinloggning

source: accessible login feature
sv: funktion för hjälpmedelsinloggning

source: The GNOME Desktop includes an Accessible Login feature, enabling users to:
sv: GNOME-skrivbordet inkluderar funktionen Hjälpmedelsinloggning vilken låter användare att:

source: Log in to the desktop even if the user cannot easily use the screen, mouse, or keyboard in the usual way.
sv: Logga in till skrivbordet även om användaren inte helt enkelt kan använda skärm, mus eller tangentbord på det vanliga sättet.

source: Launch assistive technologies at login time by associating a user action with an assistive technology application. The user can perform the user action from the standard keyboard, or from a keyboard, pointing device, or switch device that is attached to the USB or PS/2 mouse port. These user actions are called <emphasis>gestures</emphasis>.
sv: Starta hjälpmedelstekniker vid tid för inloggningen genom att associera en användaråtgärd med ett hjälpmedelsprogram. Användaren kan genomföra användaråtgärden från standardtangentbordet eller från ett tangentbord, pekdon eller brytare som är ansluten till en USB eller PS/2-musport. Dessa användaråtgärder kallas för <emphasis>gester</emphasis>.

source: Change the visual appearance of the login dialog before the user logs in; for example, using a high-contrast theme for better visibility.
sv: Ändra det synliga utseendet för inloggningsdialogen innan användaren loggar in, använd exempelvis ett tema med hög kontrast för bättre synlighet.

source: Accessible login features are presently 100% functioning for Solaris only.
sv: Funktioner för hjälpmedelsinloggning fungerar för närvarande endast 100% på Solaris.

source: Enabling Accessible Login
sv: Aktivera hjälpmedelsinloggning

source: In order to use the accessibility support for GNOME, the accessibility infrastructure must be enabled. To enable GNOME accessibility features from the command line, type the following command and then log out:
sv: För att kunna använda hjälpmedelsstödet i GNOME så måste infrastrukturen för hjälpmedlen aktiveras. Ange följande kommando för att aktivera hjälpmedelsfunktionerna i GNOME från kommandoraden, logga sedan ut:

source: To enable GNOME accessibility features from a GUI, run the <menuchoice><guimenuitem>System</guimenuitem><guimenuitem>Preferences</guimenuitem><guimenuitem>Assistive Technology</guimenuitem></menuchoice> command from the top level menu. Select the <guilabel>"Enable assistive technologies"</guilabel> checkbox and then press the <guilabel>"Close and Log Out"</guilabel> button.
sv: För att aktivera hjälpmedelsfunktionerna i GNOME från ett grafiskt gränssnitt så kör kommandot <menuchoice><guimenuitem>System</guimenuitem><guimenuitem>Inställningar</guimenuitem><guimenuitem>Hjälpmedelsteknik</guimenuitem></menuchoice> från toppnivåmenyn. Markera kryssrutan <guilabel>"Aktivera hjälpmedelsfunktioner"</guilabel> och tryck sedan på knappen <guilabel>"Stäng och logga ut"</guilabel>.

source: The next time you log in, assistive technology support will be enabled for the desktop.
sv: Nästa gång som du loggar in så kommer stöd för hjälpmedelsteknik att vara aktiverat för skrivbordet.

source: To configure GDM by using the GUI (the preferred method), perform the following steps:
sv: Genomför följande steg för att konfigurera GDM via det grafiska gränssnittet (den föredragna metoden):

source: Log in as the <literal>root</literal> user.
sv: Logga in som användaren <literal>root</literal>.
