Repository: eurolinux-enterprise-linux-sources/gnome-user-docs
Catalog: src/gnome2-accessibility-guide/*/*.po
Languages: sv

source: Position the cursor at the end of the current paragraph. Press and hold <keycap>Ctrl</keycap> and continue to press the <keycap>down arrow</keycap> key to position the cursor at the end of the next paragraph.
sv: Placera markören på slutet av det aktuella stycket. Tryck och håll ner <keycap>Ctrl</keycap> och fortsätt med att trycka på <keycap>nedåtpil</keycap> för att placera markören på slutet av nästa stycke.

source: Position the cursor one view width to the left.
sv: Placera markören en vybredd till vänster.

source: Position the cursor one view width to the right.
sv: Placera markören en vybredd till höger.

source: Position the cursor at the start of the text box.
sv: Placera markören i början av textrutan.

source: Position the cursor at the end of the text box.
sv: Placera markören på slutet av textrutan.

source: Give focus to the next control on the dialog.
sv: Ge fokus till nästa kontroll i dialogrutan.

source: Select the text to the start of the current view. Press and hold <keycap>Shift</keycap> and continue to press <keycap>Page Up</keycap> to extend the selection to the start of the previous view.
sv: Markera texten till början av den aktuella vyn. Tryck och håll ner <keycap>Skift</keycap> och fortsätt med att trycka <keycap>Page Up</keycap> för att utöka markeringen till början av föregående vy.

source: Select the text to the end of the current view. Press and hold <keycap>Shift</keycap> and continue to press <keycap>Page Down</keycap> to extend the selection to the end of the next view.
sv: Markera texten till slutet av den aktuella vyn. Tryck och håll ner <keycap>Skift</keycap> och fortsätt med att trycka <keycap>Page Down</keycap> för att utöka markeringen till slutet av nästa vy.

source: Select the text to the start of the line.
sv: Markera texten till början av raden.

source: Select the text to the end of the line.
sv: Markera texten till slutet av raden.

source: Select the text to the start of the paragraph, then to the start of the previous paragraph.
sv: Markera texten till början av stycket, sedan till början av föregående stycke.

source: Select the text to the end of the paragraph, then to the end of the next paragraph.
sv: Markera texten till slutet av stycket, sedan till slutet av nästa stycke.

source: Select the text to the start of the text box.
sv: Markera texten till början av textrutan.

source: Select the text to the end of the text box.
sv: Markera texten till slutet av textrutan.

source: Navigating Spin Boxes
sv: Navigera i snurrväljare

source: for spin boxes
sv: för snurrväljare

source: A spin box is a control that allows you to type a numeric value or select a value from a list of all possible values.
sv: En snurrväljare är en kontroll som låter dig ange ett numeriskt värde eller välja ett värde från en lista över möjliga värden.

source: Sample Spin Box
sv: Exempel på snurrväljare

source: Sample spin box. Contains a text box and up and down arrows.
sv: Exempel på snurrväljare. Innehåller en textruta och upp- och nedpilar.

source: The keyboard shortcuts that you use to navigate the text box area of a spin box are listed in <xref linkend="keynav-28"/>. The following table lists the keyboard shortcuts that you can use to navigate the up and down arrows in the spin box:
sv: Tangentbordsgenvägar som du använder för att navigera i textrutans område i en snurrväljare listas i <xref linkend="keynav-28"/>. Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera uppåt- och nedåtpilarna i snurrväljaren:

source: <keycap>up arrow</keycap> or <keycap>down arrow</keycap>
sv: <keycap>uppåtpil</keycap> eller <keycap>nedåtpil</keycap>

source: Increase or decrease the value of the spin box by a small amount.
sv: Öka eller minska värdet för snurrväljaren med en liten mängd.

source: <keycap>Page Up</keycap> or <keycap>Page Down</keycap>
sv: <keycap>Page Up</keycap> eller <keycap>Page Down</keycap>

source: Increase or decrease the value of the spin box by a large amount.
sv: Öka eller minska värdet för snurrväljaren med en stor mängd.

source: Navigating Drop-Down Lists
sv: Navigera i rullgardinslistor

source: for drop-down lists
sv: för rullgardinslistor

source: A drop-down list is a control that you use to select one of several available items. The drop-down list contains a button that you use to display the available items.
sv: En rullgardinslista är en kontroll som du använder för att välja ett av flera tillgängliga objekt. Rullgardinslistan innehåller en knapp som du använder för att visa de tillgängliga objekten.

source: Sample Drop-Down List
sv: Exempel på rullgardinslista

source: Sample drop-down list.
sv: Exempel på rullgardinslista.

source: The following table lists the keyboard shortcuts that you can use to navigate a drop-down list:
sv: Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera en rullgardinslista:

source: This key performs one of the following functions:
sv: Denna tangent genomför en av följande funktioner:

source: If the drop-down list is not open, this key opens the drop-down list.
sv: Om rullgardinslistan inte är öppen så öppnar denna tangent rullgardinslistan.

source: If the drop-down list is open, this key accepts the current selection and closes the list.
sv: Om rullgardinslistan är öppen så accepterar denna tangent den aktuella markeringen och stänger listan.

source: Select the previous list item.
sv: Välj föregående listobjekt.

source: Select the next list item.
sv: Välj nästa listobjekt.

source: Close the list without changing the selection.
sv: Stäng listan utan att ändra valet.

source: Navigating Drop-Down Combination Boxes
sv: Navigera rullgardinskombinationsrutor

source: for drop-down combination boxes
sv: för kombinationsrutor med rullgardin

source: A drop-down combination box is a text box with a drop-down list attached.
sv: En rullgardinskombinationsruta är en textruta med en bifogad rullgardinslista.

source: Sample Drop-Down Combination Box
sv: Exempel på kombinationsruta med rullgardin

source: Sample drop-down combination box. Contains a text box and an arrow button that you click to display the drop-down list.
sv: Exempel på kombinationsruta med rullgardin. Innehåller en textruta och en pilknapp som du kan klicka för att visa en rullgardinslista.

source: When the text box has focus, use the keyboard shortcuts that are listed in <xref linkend="keynav-28"/> to navigate the text box area. When the text box has focus, you can also use the keyboard shortcuts in the following table to navigate the drop-down list area:
sv: När textrutan har fokus så använd tangentbordsgenvägarna som listas i <xref linkend="keynav-28"/> för att navigera i textrutans område. När textrutan har fokus så kan du även använda tangentbordsgenvägarna i följande tabell för att navigera i rullgardinslistans område:

source: Select the previous item from the drop-down list without displaying the list.
sv: Välj föregående objekt från rullgardinslistan utan att visa listan.

source: Select the next item from the drop-down list without displaying the list.
sv: Välj nästa objekt från rullgardinslistan utan att visa listan.

source: Open the drop-down list.
sv: Öppna rullgardinslistan.

source: When the drop-down list has focus, you can use the keyboard shortcuts that are listed in the following table to navigate the drop-down list:
sv: När rullgardinslistan har fokus så kan du använda tangentbordsgenvägar som listas i följande tabell för att navigera i rullgardinslistan:

source: Select the first item in the list.
sv: Välj det första objektet i listan.

source: Select the last item in the list.
sv: Välj sista objektet i listan.

source: Select the item at the top of the current list view.
sv: Välj objektet överst i den aktuella listvyn.

source: Select the item at the bottom of the current list view.
sv: Välj objektet nederst i den aktuella listvyn.

source: Accept the current selection and close the drop-down list.
sv: Acceptera den aktuella markeringen och stäng rullgardinslistan.

source: Scroll to the left of the list, if required.
sv: Rulla till vänster i listan, om det behövs.

source: Scroll to the right of the list, if required.
sv: Rulla till höger i listan, om det behövs.

source: Navigating Sliders
sv: Navigera i draglister

source: for sliders
sv: för draglister

source: A slider is a control that you use to set a value in a continuous range of values.
sv: En draglist är en kontroll som du använder för att ange ett värde i ett oavbrutet intervall av värden.

source: Sample Slider
sv: Exempel på draglist

source: Sample slider. Displays a slider control that you can move left or right.
sv: Exempel på draglist. Visar en draglistskontroll som du kan flytta åt vänster eller höger.

source: The following table describes the keyboard shortcuts that you can use to navigate a slider:
sv: Följande tabell beskriver tangentbordsgenvägarna som du kan använda för att navigera en draglist:

source: <keycap>left arrow</keycap> or <keycap>up arrow </keycap>
sv: <keycap>vänsterpil</keycap> eller <keycap>uppåtpil </keycap>

source: Move the slider left or up by a small amount.
sv: Flytta draglisten lite åt vänster eller uppåt.

source: <keycap>right arrow</keycap> or <keycap>down arrow</keycap>
sv: <keycap>högerpil</keycap> eller <keycap>nedåtpil</keycap>

source: Move the slider right or down by a small amount.
sv: Flytta draglisten lite åt höger eller nedåt.

source: Move the slider left or up by a large amount.
sv: Flytta draglisten åt vänster eller mycket uppåt.

source: Move the slider right or down by a large amount.
sv: Flytta draglisten åt höger eller mycket nedåt.

source: Move the slider to the maximum value.
sv: Flytta draglisten till maximala värdet.

source: Move the slider to the minimum value.
sv: Flytta draglisten till minimala värdet.

source: Navigating Tabbed Sections
sv: Navigera i flikade sektioner

source: for tabbed sections
sv: för flikade sektioner

source: Sample Dialog with Tabbed Sections
sv: Exempeldialogruta med flikade sektioner

source: Editing profile dialog from the GNOME <placeholder-1/> application; contains six tabbed sections.
sv: Redigering av profildialog från GNOME-programmet <placeholder-1/>; innehåller sex flikade sektioner.

source: Windows and dialogs are sometimes divided into logical sections that are displayed one section at a time on the window or dialog. The overall control is referred to as a notebook or tabbed panel. The divisions are called panels, pages, or tabs, and are sometimes collectively referred to as a tabstrip or notebook header. Each individual tab is identified by a text label.
sv: Fönster och dialogrutor är ibland uppdelade i logiska sektioner som visar en sektion åt gången i fönstret eller dialogrutan. Den överliggande kontrollen refereras till som ett flikhäfte eller flikad panel. Uppdelningarna kallas för paneler, sidor eller flikar, och refereras ibland gemensamt som en flikremsa eller flikhäftesrubrik. Varje individuell flik identifieras av en textetikett.

source: The following table lists the keyboard shortcuts that you can use to navigate the tabbed sections of a window or dialog when a tabstrip has focus:
sv: Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera i flikade sektioner av ett fönster eller dialogruta när ett fliknamn har fokus:

source: Give focus to the previous tabbed section.
sv: Ge fokus till föregående fliksektion.

source: Give focus to the next tabbed section.
sv: Ge fokus till nästa fliksektion.

source: <keycap>Tab</keycap> or<keycombo><keycap>Ctrl</keycap><keycap>down arrow </keycap></keycombo>
sv: <keycap>Tabulator</keycap> eller <keycombo><keycap>Ctrl</keycap><keycap>nedåtpil </keycap></keycombo>

source: Give focus to the first control in the active section.
sv: Ge fokus till första kontrollern i den aktiva sektionen.

source: The following table lists the keyboard shortcuts that you can use to navigate a window or dialog when a control within a section has focus:
sv: Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera i ett fönster eller dialogruta inom en sektion som har fokus:

source: Give focus to the previous section.
sv: Ge fokus till föregående sektion.

source: Give focus to the next section.
sv: Ge fokus till nästa sektion.

source: Give focus to the next control outside the sections.
sv: Ge fokus till nästa kontroll utanför sektionerna.

source: Navigating Lists
sv: Navigera i listor

source: for lists
sv: för listor

source: The following table lists the keyboard shortcuts that you can use to navigate multi-column lists when a column header has focus:
sv: Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera i flerkolumnslistor när ett kolumnhuvud har fokus:

source: <keycap>left arrow</keycap> or <keycap>right arrow</keycap>
sv: <keycap>vänsterpil</keycap> eller <keycap>högerpil</keycap>

source: Give focus to the previous or next column header.
sv: Ge fokus till föregående eller nästa kolumnhuvud.

source: Activate the header. This action usually sorts the list by the column header.
sv: Aktivera huvudet. Den här åtgärder sorterar oftast listan efter kolumnhuvudet.

source: Give focus to the list contents.
sv: Ge fokus till listans innehåll.

source: The following table lists the keyboard shortcuts that you can use to navigate lists when the list area has focus:
sv: Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera i listor när listområdet har fokus:

source: Select the next or previous row or column.
sv: Välj nästa eller föregående rad eller kolumn.

source: Select the top row of the list contents that are currently in view. Press <keycap>Page Up</keycap> again to select the top row of the previous view.
sv: Välj översta raden i listans innehåll som för närvarande visas. Tryck på <keycap>Page Up</keycap> igen för att välja översta raden i föregående vy.

source: Select the bottom row of the list contents that are currently in view. Press <keycap>Page Down</keycap> again to select the bottom row of the next view.
sv: Välj nedersta raden i listans innehåll som för närvarande visas. Tryck på <keycap>Page Down</keycap> igen för att välja nedersta raden i nästa vy.

source: Select the first row in the list.
sv: Välj första raden i listan.

source: Select the last row in the list.
sv: Välj sista raden i listan.

source: For lists that support multi-line selections, add the next or previous row or column to the current selection.
sv: För listor som har stöd för flerradiga markeringar, lägg till nästa eller föregående rad eller kolumn till aktuell markering.

source: For lists that only allow single line selections, select the next or previous row or column.
sv: För listor som endast tillåter enradiga markeringar, markera nästa eller föregående rad eller kolumn.

source: Select all the rows between the current selection and the top row of the view.
sv: Markera alla rader mellan aktuell markering och översta raden i vyn.

source: Select all the rows between the current selection and the bottom row of the view.
sv: Markera alla rader mellan aktuell markering och nedersta raden i vyn.

source: Select all the rows between the current selection and the first row in the list.
sv: Markera alla rader mellan aktuell markering och första raden i listan.

source: Select all the rows between the current selection and the last row in the list.
sv: Markera alla rader mellan aktuell markering och sista raden i listan.

source: Give focus to the next row or column without extending the selection. Further items can be selected by pressing <keycap>spacebar</keycap>.
sv: Ge fokus till nästa rad eller kolumn utan att utöka markeringen. Ytterligare objekt kan markeras genom att trycka på <keycap>blanksteg</keycap>.

source: Give focus to the top row in the view without extending the selection.
sv: Ge fokus till översta raden i vyn utan att utöka markeringen.

source: Give focus to the bottom row in the view without extending the selection.
sv: Ge fokus till nedersta raden i vyn utan att utöka markeringen.

source: Give focus to the first row in the list without extending the selection.
sv: Ge fokus till första raden i listan utan att utöka markeringen.

source: Give focus to the last row in the list without extending the selection.
sv: Ge fokus till sista raden i listan utan att utöka markeringen.

source: Activate the item(s).
sv: Aktivera objekt(en).

source: Select all rows (for lists that support multi-line selections).
sv: Markera alla rader (för listor som har stöd för fler-radiga markeringar).

source: Give focus to the column header, if applicable.
sv: Ge fokus till kolumnhuvudet, om möjligt.

source: Navigating Trees
sv: Navigera i träd

source: A tree is a user interface control that contains sections that you can expand and collapse. A tree usually represents a hierarchical structure.
sv: Ett träd är en användargränssnittskontroll som innehåller sektioner som du kan fälla ut och in. Ett träd representeras oftast av en hierarkisk struktur.

source: Sample Tree Structure
sv: Exempel på trädstruktur

source: Categories tree from the <placeholder-1/> preferences dialog; contains three subcategories.
sv: Kategoriträd från inställningsdialogen för <placeholder-1/> ; innehåller tre underkategorier.

source: To navigate trees, you can use the same keyboard shortcuts that are listed in <xref linkend="keynav-34"/>. In addition, the following table lists the keyboard shortcuts you can use for the tree items:
sv: För att navigera i träd så kan du använda samma tangentbordsgenvägar som listas i <xref linkend="keynav-34"/>. I tillägg så kan du använda följande tabell som listar tangentbordsgenvägar för trädobjekten:

source: <keycap>+</keycap> (plus) or <keycombo><keycap>shift</keycap><keycap>right</keycap></keycombo>
sv: <keycap>+</keycap> (plus) eller <keycombo><keycap>skift</keycap><keycap>höger</keycap></keycombo>

source: Expand the focused item.
sv: Fäll ut det fokuserade objektet.

source: <keycap>-</keycap> (minus) or <keycombo><keycap>shift</keycap><keycap>left</keycap></keycombo>
sv: <keycap>-</keycap> (minus) eller <keycombo><keycap>skift</keycap><keycap>vänster</keycap></keycombo>

source: Collapse the focused item.
sv: Fäll in det fokuserade objektet.

source: Select the parent item.
sv: Markera föräldraobjektet.

source: Display a search dialog, allowing you to type the name of the tree item that you want to find. Not all trees support searching.
sv: Visa en sökdialog som låter dig ange namnet på trädobjektet som du vill hitta. Inte alla träd har stöd för sökningar.

source: Customizing Your Keyboard Shortcuts
sv: Anpassning av dina tangentbordsgenvägar

source: customizing
sv: anpassning

source: Use the <application>Keyboard Shortcuts</application> preference tool to display the default keyboard shortcuts that you use to navigate the GNOME Desktop. You can customize the default keyboard shortcuts to meet your requirements. You can also create hot keys (keyboard shortcuts which start applications).
sv: Använd inställningsverktyget <application>Tangentbordsgenvägar</application> för att visa standardtangentbordsgenvägarna som du använder för att navigera i GNOME-skrivbordet. Du kan anpassa standardtangentbordsgenvägarna så att de passar dina behov. Du kan även skapa snabbtangenter (tangentbordsgenvägar som startar program).

source: To start the <application>Keyboard Shortcuts </application> preference tool, choose <menuchoice><guimenu>System</guimenu><guisubmenu>Preferences </guisubmenu><guimenuitem>Keyboard Shortcuts </guimenuitem></menuchoice>. The <guilabel> Desktop shortcuts</guilabel> table lists the keyboard shortcuts that are associated with each action.
sv: För att starta inställningsverktyget <application>Tangentbordsgenvägar </application>, välj <menuchoice><guimenu>System</guimenu><guisubmenu>Inställningar </guisubmenu><guimenuitem>Tangentbordsgenvägar </guimenuitem></menuchoice>. Tabellen <guilabel> Skrivbordsgenvägar</guilabel> listar tangentbordsgenvägarna som är associerade med varje åtgärd.

source: Assigning and Clearing Keyboard Shortcuts
sv: Tilldela och ta bort tangentbordsgenvägar

source: To assign a keyboard shortcut, perform the following steps:
sv: Genomför följande steg för att tilldela en tangentbordsgenväg:

source: Click on the action for which you want to customize the keyboard shortcut. The row is highlighted and the text <quote>Type a new accelerator, or press Backspace to clear</quote> is displayed in the Shortcut column.
sv: Klicka på åtgärden för vilken du vill anpassa tangentbordsgenvägen. Raden markeras och texten <quote>Ange ny snabbtangent, eller tryck Backsteg för att rensa</quote> kommer att visas i kolumnen Genväg.

source: Press the keys that you want to associate with the action. The new keyboard shortcut is displayed in the <guilabel>Shortcut</guilabel> column.
sv: Tryck på tangenterna som du vill associera med åtgärden. Den nya tangentbordsgenvägen visas i kolumnen <guilabel>Genväg</guilabel>.

source: To disable a keyboard shortcut, perform the following steps:
sv: Genomför följande steg för att inaktivera en tangentbordsgenväg:

source: Click on the action for which you want to disable the keyboard shortcut. The row is highlighted and the text <quote>Type a new accelerator, or press Backspace to clear</quote> is displayed in the Shortcut column.
sv: Klicka på åtgärden för vilken du vill inaktivera tangentbordsgenvägen. Raden markeras och texten <quote>Ange ny snabbtangent, eller tryck på Backsteg för att rensa</quote> visas i kolumnen Genväg.

source: Press the <keycap>backspace</keycap>. The keyboard shortcut is disabled.
sv: Tryck på <keycap>backsteg</keycap>. Tangentbordsgenvägen är inaktiverad.

source: Low Vision or Blindness
sv: Nedsatt syn eller blindhet

source: From low vision to blindness, the range of visual limitations is broad. Symptoms of low vision include dimness, haziness, extreme far-/near-sightedness, color blindness, and tunnel vision, among others. People with these disabilities are concerned with being able to see text or images on a computer screen and being able to perform tasks that require eye-hand coordination, such as moving a computer mouse. Text size and color can make a big difference in legibility for people with low vision.
sv: Från nedsatt syn till blindhet, omfånget av visuella begränsningar är bred. Symptomen av nedsatt syn inkluderar dimmig syn, oklar syn, när- och långsynhet, färgblindhet och tunnelseende, bland annat. Personer med dessa handikapp är bekymrade över att kunna se text eller bilder på en datorskärm och kunna genomföra uppgifter som kräver öga-hand-koordination, såsom att förflytta en datormus. Textstorlek och färg kan göra en stor skillnad för läsligheten för personer med nedsatt syn.

source: The technologies that can assist those with low vision or blindness are:
sv: Teknologierna som kan hjälpa de som har nedsatt syn eller blindhet är:

source: <emphasis>Desktop Appearance Enhancement</emphasis> - users can configure the desktop to be easy to read; for example, by increasing text size and using high-contrast themes.
sv: <emphasis>Förbättring av skrivbordsutseendet</emphasis> - använder kan konfigurera skrivbordet till att vara enkelt att läsa; till exempel genom att öka textstorleken och att använda teman med hög kontrast.
