Repository: eurolinux-enterprise-linux-sources/gnome-user-docs
Catalog: src/gnome2-accessibility-guide/*/*.po
Languages: sv

source: Expand the pane to the maximum size allowed.
sv: Förstora panelen till den största tillåtna storleken.

source: For vertical panes, increases the size of the pane to the left of the resize handle to the maximum size allowed.
sv: För vertikala paneler ökas storleken på panelen till vänster om storleksändringshandtaget till den största tillåtna storleken.

source: For horizontal panes, increases the size of the pane above the resize handle to the maximum size allowed.
sv: För horisontella paneler ökas storleken på panelen ovanför storleksändringshandtaget till den största tillåtna storleken.

source: Set the position of the resize handle and return focus to the last control that had focus.
sv: Ställ in positionen för storleksändringshandtaget och återställ fokus till senaste kontrollen som hade fokus.

source: Reset the position of the resize handle to the original position and return focus to the last control that had focus.
sv: Nollställ positionen för storleksändringshandtaget till den ursprungliga positionen och återställ fokus till senaste kontrollen som hade fokus.

source: Navigating Applications
sv: Navigera i program

source: for applications
sv: för program

source: An application is any program, utility, or other software package that you run on your desktop. Applications contain standard user interface components:
sv: Ett program är ett valfritt program, verktyg eller annan typ av programpaket som du kör på ditt skrivbord. Program innehåller standardkomponenter för användargränssnitt:

source: Windows
sv: Fönster

source: A window is a rectangular frame on your screen that displays an application. See <xref linkend="keynav-11"/> for information about how to navigate windows.
sv: Ett fönster är en rektangulär ruta på din skärm som visar ett program. Se <xref linkend="keynav-11"/> för information om hur man navigerar i fönster.

source: Dialogs
sv: Dialogrutor

source: A dialog is a popup window which displays information or accepts input from the user. See <xref linkend="keynav-19"/> for information about how to navigate dialogs.
sv: En dialogruta är ett popupfönster som visar information eller tar emot inmatningar från användaren. Se <xref linkend="keynav-19"/> för information om hur man navigerar i dialogrutor.

source: Controls
sv: Kontroller

source: A control is any user-interactive screen element. Examples of controls include buttons, check boxes, menus, and text boxes. See <xref linkend="keynav-23"/> for detailed information about how to navigate the different types of controls that are available.
sv: En kontroll är ett användarinteraktivt skärmelement. Exempel på kontroller inkluderar knappar, kryssrutor, menyer och textrutor. Se <xref linkend="keynav-23"/> för detaljerad information om hur man navigerar i de olika typerna av kontroller som finns tillgängliga.

source: This section of the manual describes the essential keyboard shortcuts that you can use in applications and dialogs.
sv: Detta avsnitt av handboken beskriver de grundläggande tangentbordsgenvägar som du kan använda i program och dialogrutor.

source: Essential Keyboard Shortcuts for Navigating Applications
sv: Grundläggande tangentbordsgenvägar för navigering i program

source: Since there are so many applications that you can use in the GNOME Desktop, this manual does not describe all the custom keyboard shortcuts that you can use with each individual application. However, the basic keyboard shortcuts are common to many applications.
sv: Eftersom det finns så många program som du kan använda i GNOME-skrivbordet så kan inte denna handbok beskriva alla de anpassade tangentbordsgenvägar som du kan använda med varje individuellt program. Dock är de grundläggande tangentbordsgenvägarna gemensamma för många program.

source: Access keys are another way to quickly navigate applications with the keyboard. An access key is identified by an underlined letter on a menu or control. In some cases, you must press <keycap>Alt</keycap> in combination with the access key to perform an action.
sv: Snabbtangenter är ett annat sätt att snabbt navigera i program med tangentbordet. En snabbtangent identifieras av en understruken bokstav på en meny eller kontroll. I vissa fall så måste du trycka på <keycap>Alt</keycap> i kombination med snabbtangenten för att genomföra en åtgärd.

source: The following table lists the essential keyboard shortcuts that you can use to navigate applications:
sv: Följande tabell listar de grundläggande tangentbordsgenvägarna som du kan använda för att navigera i program:

source: Open the first menu on the application menubar.
sv: Öppna första menyn på programmets menyrad.

source: <keycap>Alt</keycap> + access key
sv: <keycap>Alt</keycap> + snabbtangent

source: Open the menu that is associated with the access key.
sv: Öppna menyn som är associerad med snabbtangenten.

source: access keys
sv: snabbtangenter

source: Select the menu item that is associated with the access key.
sv: Välj menyobjektet som är associerat med snabbtangenten.

source: <keycap>left arrow</keycap> and <keycap>right arrow</keycap>
sv: <keycap>vänsterpil</keycap> och <keycap>högerpil</keycap>

source: Switch focus between the menus on the menubar.
sv: Växla fokus mellan menyerna på menyraden.

source: <keycap>up arrow</keycap> and <keycap>down arrow</keycap>
sv: <keycap>uppåtpil</keycap> och <keycap>nedåtpil</keycap>

source: Move focus into a menu.
sv: Flytta fokus till en meny.

source: Close the open menu and give focus to the control that had focus before the menubar.
sv: Stäng den öppna menyn och ge fokus till kontrollen som hade fokus innan menyraden.

source: Open the file selector dialog.
sv: Öppna filväljardialogrutan.

source: Open the Save dialog.
sv: Öppna Spara-dialogrutan.

source: Open a Location dialog, enabling you to type the name of a file that you want to open or save.
sv: Öppna en Plats-dialogruta som låter dig ange namnet på en fil som du vill öppna eller spara.

source: Open a Print dialog, if available.
sv: Öppna en Skriv ut-dialog, om tillgänglig.

source: Copy highlighted text to the global, application-spanning clipboard.
sv: Kopiera markerad text till det allmänna, programoberoende urklippet.

source: Cut highlighted text to the global, application-spanning clipboard.
sv: Klipp ut markerad text till det allmänna, programoberoende urklippet.

source: Paste text from the global, application-spanning clipboard to the current cursor position.
sv: Klistra in text från det allmänna, programoberoende urklippet till den aktuella markörpositionen.

source: Essential Keyboard Shortcuts for Navigating Dialogs
sv: Grundläggande tangentbordsgenvägar för navigering i dialogrutor

source: for dialogs
sv: för dialogrutor

source: The following table lists the essential keyboard shortcuts that you can use to navigate dialogs:
sv: Följande tabell listar de grundläggande tangentbordsgenvägarna som du kan använda för att navigera i dialogrutor.

source: access key
sv: snabbtangent

source: Activate or select a control.
sv: Aktivera eller välj en kontroll.

source: Give focus to the next control.
sv: Ge fokus till nästa kontroll.

source: Move to the next page/tabbed section of the dialog.
sv: Flytta till nästa sida/flikade sektion i dialogrutan.

source: Move to the previous page/tabbed section of the dialog.
sv: Flytta till föregående sida/flikade sektion i dialogrutan.

source: Cancel/dismiss the dialog. Some application-specific dialogs may retain dialog settings, but this practice is discouraged. These dialogs usually have a single <guilabel>Close</guilabel> button, with no <guilabel>Ok/Accept</guilabel> buttons.
sv: Avbryt/stäng dialogrutan. Vissa programspecifika dialogrutor kan behålla dialoginställningar men detta förfarande rekommenderas inte. Dessa dialogrutor har oftast en enda <guilabel>Stäng</guilabel>-knapp och saknar <guilabel>Ok/Acceptera</guilabel>-knappar.

source: Perform the default action for the dialog. The default action will usually apply any changes and close the dialog. A default button will have a bold outline and a selected button will have a slightly bolder outline than the default button.
sv: Genomför standardåtgärden för dialogrutan. Standardåtgärden kommer oftast att verkställa alla ändringar och stäng dialogrutan. En standardknapp kommer att ha en tjock kontur och en markerad knapp kommer att ha en lite tjockare kontur än standardknappen.

source: Navigating the File Manager
sv: Navigera i filhanteraren

source: for file manager
sv: för filhanterare

source: By default, the file manager operates in <guilabel>Spatial</guilabel> mode. This mode uses separate windows for each folder. Conversely, <guilabel>Browser</guilabel> mode will reuse the same window for each folder.
sv: Som standard arbetet filhanteraren i <guilabel>spatialt</guilabel> läge. Detta läge använder separata fönster för varje mapp. I motsats till det så återanvänder <guilabel>Bläddrar</guilabel>-läget samma fönster för varje mapp.

source: For more information about different modes for the file manager, see <ulink url="ghelp:user-guide?nautilus-presentation"> the user guide</ulink>.
sv: Se <ulink url="ghelp:user-guide?nautilus-presentation"> användarguiden</ulink> för mer information om filhanterarens olika lägen.

source: Navigating Folders
sv: Navigera i mappar

source: The following table describes the keyboard shortcuts that enable you to navigate folders in the file manager:
sv: Följande tabell beskriver tangentbordsgenvägarna som låter dig navigera i mappar i filhanteraren:

source: Select the next or previous file or folder in the direction of the arrow key.
sv: Markera nästa eller föregående fil eller mapp i riktningen för piltangenten.

source: Give focus to the next or previous file or folder but do not select the item. This allows multiple, non-contiguous blocks of files to be selected.
sv: Ge fokus till nästa eller föregående fil eller mapp men markerade inte objektet. Detta gör att flera icke-angränsande filer kan markeras.

source: Open the focused file or folder.
sv: Öppna fokuserad fil eller mapp.

source: <keycap>Ctrl</keycap> + <keycap>spacebar</keycap>
sv: <keycap>Ctrl</keycap> + <keycap>blanksteg</keycap>

source: Select the item that currently has focus.
sv: Välj objektet som för närvarande har fokus.

source: A sequence of characters that matches the first <replaceable>n</replaceable> characters of a filename.
sv: En teckensekvens som matchar de första <replaceable>n</replaceable> tecknen i ett filnamn.

source: Select the first file or folder that starts with the specified sequence of characters.
sv: Välj första filen eller mappen som börjar med den angivna teckensekvensen.

source: Select the first file or folder within the current folder.
sv: Välj första filen eller mappen inom den aktuella mappen.

source: Select the last file or folder within the current folder.
sv: Välj den sista filen eller mappen inom den aktuella mappen.

source: backspace
sv: backsteg

source: Open the current folder's parent folder.
sv: Öppna den aktuella mappens föräldramapp.

source: Shift-F10
sv: Skift-F10

source: Open a file or folder popup menu.
sv: Öppna en fil eller mappens popupmeny.

source: Open the enclosing folder's popup menu (equivalent to right-clicking on the view pane background).
sv: Öppna den inneslutande mappens popupmeny (motsvarande högerklick på vypanelens bakgrund).

source: Navigating Browser Window Components
sv: Navigera bland komponenter i bläddrarfönster

source: When operating in <guilabel>Browser</guilabel> mode, the file manager window contains several components, with keyboard shortcuts defined to navigate each component:
sv: När arbete sker i <guilabel>Bläddrar</guilabel>-läget så innehåller filhanteraren flera olika komponenter med tangentbordsgenvägar definierade för att navigera i varje komponent:

source: Switch focus between the side pane and the view pane.
sv: Växla fokus mellan sidopanelen och vypanelen.

source: Open the side pane popup menu.
sv: Öppna sidopanelens popupmeny.

source: Caret Navigation Mode
sv: Markörnavigeringsläge

source: The following table describes how to use caret navigation mode (eg, in supporting applications like <application>Yelp</application>, <application>Evolution</application>, <application>Epiphany</application>, or <application>Firefox</application>). In computing, caret navigation is a kind of keyboard navigation where a caret (also known as "text cursor", "text insertion cursor", or "text selection cursor") is used to navigate and select text within a document.
sv: Följande tabell beskriver hur man använder markörnavigeringsläget (t.ex. i program som har stöd för det som <application>Yelp</application>, <application>Evolution</application>, <application>Epiphany</application> eller <application>Firefox</application>). I datorsammanhang så är markörnavigering en typ av tangentbordsnavigering där en markör (även känd som "textmarkör", "textinmatningsmarkör" eller "textmarkeringsmarkör") används för att navigera och markera text inom ett dokument.

source: Switch to caret navigation mode [Yelp-only].
sv: Växla till markörnavigeringsläget [endast Yelp].

source: left arrow
sv: vänsterpil

source: Move one character to the left.
sv: Flytta ett tecken till vänster.

source: right arrow
sv: högerpil

source: Move one character to the right.
sv: Flytta ett tecken till höger.

source: up arrow
sv: uppåtpil

source: Move up one line.
sv: Flytta en rad uppåt.

source: down arrow
sv: nedåtpil

source: Move down one line.
sv: Flytta en rad nedåt.

source: <keycap>Ctrl</keycap> + left arrow
sv: <keycap>Ctrl</keycap> + vänsterpil

source: Move to the beginning of the previous word.
sv: Flytta till början av det föregående ordet.

source: <keycap>Ctrl</keycap> + right arrow
sv: <keycap>Ctrl</keycap> + högerpil

source: Move to the end of the next word.
sv: Flytta till slutet av nästa ord.

source: Scroll up one page of content.
sv: Rulla uppåt en sida i innehållet.

source: Scroll down one page of content.
sv: Rulla nedåt en sida i innehållet.

source: Move to the beginning of the current line.
sv: Flytta till början av den aktuella raden.

source: Move to the end of the current line.
sv: Flytta till slutet av den aktuella raden.

source: Move from the current position to the destination position, selecting all text between the two positions.
sv: Flytta från den aktuella positionen till målpositionen och markera all text mellan de två positionerna.

source: Move focus to the next focusable control.
sv: Flytta fokus till nästa fokuserbara kontroll.

source: Move focus to the previous focusable control.
sv: Flytta fokus till föregående fokuserbara kontroll.

source: Activate a button, link or other control.
sv: Aktivera en knapp, länk eller annan kontroll.

source: Navigating Standard Elements and Controls
sv: Navigera i standardelement och kontroller

source: The following sections describe how to navigate and use standard user interface elements and controls from the keyboard.
sv: Följande avsnitt beskriver hur man navigerar och använder standardelement i användargränssnittet och styr dem från tangentbordet.

source: Navigating Menus
sv: Navigera i menyer

source: for menus
sv: för menyer

source: The following table lists the keyboard shortcuts that you can use to navigate menus:
sv: Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera i menyer:

source: Give focus to the next or previous menu item on a menu.
sv: Ge fokus till nästa eller föregående menyobjekt i en meny.

source: If the menu item that has focus is a submenu, open the submenu and give focus to the first menu item on the submenu.
sv: Om menyobjektet som har fokus är en undermeny, öppna undermenyn och ge fokus till första menyobjektet i undermenyn.

source: If the menu item that has focus is not a submenu, open the next menu on the menubar.
sv: Om menyobjektet som har fokus inte är en undermeny, öppna nästa meny på menyraden.

source: If the menu item that has focus is a submenu item, switch the focus back to the submenu.
sv: Om menyobjektet som har fokus är ett undermenyobjekt, växla fokus tillbaka till undermenyn.

source: If the menu item that has focus is not a submenu item, open the previous menu on the menubar.
sv: Om menyobjektet som har fokus inte är ett undermenyobjekt, öppna föregående meny på menyraden.

source: Select the focused menu item and close the open menus.
sv: Välj det fokuserade menyobjektet och stäng de öppnade menyerna.

source: Select the menu item that is associated with the access key and close the menu.
sv: Välj menyobjektet som är associerat med snabbtangenten och stäng menyn.

source: Select the focused menu item and close the menu except when the menu item is a check box or radio button.
sv: Välj det fokuserade menyobjektet och stäng menyn förutom när menyobjektet är en kryssruta eller radioknapp.

source: Close the menu.
sv: Stäng menyn.

source: Navigating Buttons
sv: Navigera bland knappar

source: for buttons
sv: för knappar

source: A button is a control that you use to start an action. Most buttons are rectangular and contain a text label.
sv: En knapp är en kontroll som du använder för att starta en åtgärd. De flesta knappar är rektangulära och innehåller en textetikett.

source: Sample Button
sv: Exempelknapp

source: Close button.
sv: Stäng-knapp.

source: The following table lists the keyboard shortcuts that you can use to navigate buttons:
sv: Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera mellan knappar:

source: Activate the button that has focus. This is the equivalent of clicking on the button.
sv: Aktivera knappen som har fokus. Detta motsvarar att klicka på knappen.

source: Activate the button that has focus or, if no button has focus, perform the default action for the dialog.
sv: Aktivera knappen som har fokus eller, om ingen knapp har fokus, genomför standardåtgärden för dialogrutan.

source: Navigating Radio Buttons
sv: Navigera i radioknappar

source: for radio buttons
sv: för radioknappar

source: A radio button is a control that you use to select one of several mutually-exclusive options.
sv: En radioknapp är en kontroll som du använder för att välja en av flera liknande alternativ.

source: Sample Radio Button
sv: Exempel på radioknapp

source: Two sample radio buttons.
sv: Exempel på två radioknappar.

source: The following table lists the keyboard shortcuts that you can use to navigate a set of radio buttons:
sv: Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera mellan radioknappar:

source: Select the next or previous radio button and deselect the other radio buttons in the group.
sv: Välj nästa eller föregående radioknapp och avmarkera de andra radioknapparna i gruppen.

source: Navigating Check Boxes
sv: Navigera i kryssrutor

source: for check boxes
sv: för kryssrutor

source: A check box is a control that you use to select or deselect an option.
sv: En kryssruta är en kontroll som du använder för att markera eller avmarkera ett alternativ.

source: Sample Check Box
sv: Exempel på kryssruta

source: Sample check box.
sv: Exempel på kryssruta.

source: The following table lists the keyboard shortcuts that you can use to navigate a check box:
sv: Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera en kryssruta:

source: Select or deselect the check box.
sv: Markera eller avmarkera kryssrutan.

source: Navigating Text Boxes
sv: Navigera i textrutor

source: for text boxes
sv: för textrutor

source: Text boxes are controls in which you type text.
sv: Textrutor är kontroller i vilka du anger text.

source: Sample Single Line Text Box
sv: Exempel på enkelradig textruta

source: Sample text box with one input line.
sv: Exempel på textruta med en enda inmatningsrad.

source: The following table lists the keyboard shortcuts that you can use to navigate a single line text box:
sv: Följande tabell listar tangentbordsgenvägarna som du kan använda för att navigera i enradiga textrutor:

source: Position the cursor one character to the left.
sv: Placera markören ett tecken till vänster.

source: Position the cursor one character to the right.
sv: Placera markören ett tecken till höger.

source: Position the cursor at the start of the current word. Press and hold <keycap>Ctrl</keycap> and continue to press <keycap>left arrow</keycap> to position the cursor at the start of the previous word.
sv: Placera markören i början av det aktuella ordet. Tryck och håll ner <keycap>Ctrl</keycap> och fortsätt att trycka <keycap>vänsterpil</keycap> för att placera markören i början av det föregående ordet.

source: Position the cursor at the end of the current word. Press and hold <keycap>Ctrl</keycap> and continue to press <keycap>right arrow</keycap> to position the cursor at the end of the next word.
sv: Placera markören på slutet av det aktuella ordet. Tryck och håll ner <keycap>Ctrl</keycap> och fortsätt att trycka <keycap>högerpil</keycap> för att placera markören på slutet av det nästkommande ordet.

source: Position the cursor at the start of the line.
sv: Placera markören i början av raden.

source: Position the cursor at the end of the line.
sv: Placera markören på slutet av raden.

source: <keycombo><keycap>Shift</keycap><keycap>left arrow</keycap></keycombo> or <keycap>right arrow</keycap>
sv: <keycombo><keycap>Skift</keycap><keycap>vänsterpil</keycap></keycombo> eller <keycap>högerpil</keycap>

source: Select one character at a time to the left or right of the cursor.
sv: Markera ett tecken åt gången åt vänster eller höger om markören.

source: <keycombo><keycap>Shift</keycap><keycap>Ctrl</keycap><keycap>left arrow </keycap></keycombo> or <keycap>right arrow </keycap>
sv: <keycombo><keycap>Skift</keycap><keycap>Ctrl</keycap><keycap>vänsterpil </keycap></keycombo> eller <keycap>högerpil </keycap>

source: Select one word at a time to the left or right of the cursor.
sv: Markera ett ord åt gången till vänster eller höger om markören.

source: Select all text to the left of the cursor.
sv: Markera all text till vänster om markören.

source: Select all text to the right of the cursor.
sv: Markera all text till höger om markören.

source: Select all text in the text box.
sv: Markera all text i textrutan.

source: In addition to the keyboard shortcuts listed in the previous table, use the keyboard shortcuts in the following table to navigate multi-line text boxes:
sv: I tillägg till tangentbordsgenvägarna som listas i föregående tabell så kan tangentbordsgenvägarna i följande tabell användas för att navigera i flerradiga textrutor:

source: Position the cursor at the top of the current view. Press <keycap>Page Up</keycap> again to position the cursor at the top of the previous view.
sv: Placera markören överst i den aktuella vyn. Tryck på <keycap>Page Up</keycap> igen för att placera markören längst upp i föregående vy.

source: Position the cursor at the end of the current view. Press <keycap>Page Down</keycap> again to position the cursor at the end of the previous view.
sv: Placera markören på slutet av den aktuella vyn. Tryck på <keycap>Page Down</keycap> igen för att placera markören på slutet av den föregående vyn.

source: Position the cursor at the start of the current paragraph. Press and hold <keycap>Ctrl</keycap> and continue to press the <keycap>up arrow</keycap> key to position the cursor at the start of the previous paragraph.
sv: Placera markören i början av det aktuella stycket. Tryck och håll ner <keycap>Ctrl</keycap> och fortsätt med att trycka på <keycap>uppåtpil</keycap> för att placera markören i början av föregående stycke.
